laanwj/k210-sdk-stuff/rom/k210.rom.c
#include "k210.rom.h"

void entry_hart0(void) {
  C*extraout_a1;
  C cVar1;
  U uVar2;
  U uStack72;
  C*pcStack48;
  U uStack40;

  serial_init();
  uStack72 = boot_main();
  uStack40 = 1;
  pcStack48 = *(C**)(extraout_a1 + 0x18);
  if ((*(I*)(extraout_a1 + 8) != 0) || (uStack72 != 0)) {
    while (((J) * (I*)(extraout_a1 + 0x10) & 0xffffffffU) <=
           uStack72 / uStack40) {
      uStack40 = uStack40 * ((J) * (I*)(extraout_a1 + 0x10) & 0xffffffffU);
    }
    while (uStack40 != 0) {
      uVar2 = uStack72 / uStack40;
      uStack72 = uStack72 % uStack40;
      uStack40 = uStack40 / ((J) * (I*)(extraout_a1 + 0x10) & 0xffffffffU);
      if ((I)uVar2 < 10) {
        cVar1 = '0';
      } else {
        if ((*extraout_a1 & 4) == 0) {
          cVar1 = 'W';
        } else {
          cVar1 = '7';
        }
      }
      *pcStack48 = cVar1 + (C)uVar2;
      pcStack48 = pcStack48 + 1;
    }
    *(C**)(extraout_a1 + 0x20) = pcStack48 + -*(J*)(extraout_a1 + 0x18);
  }
  R;
}

void fcn_8800013c(U a1, C*a2)
{
  C cVar1;
  U uVar2;
  U l38;
  C*l20;
  U l18;

  l18 = 1;
  l20 = *(C**)(a2 + 0x18);
  if ((*(I*)(a2 + 8) != 0) || (a1 != 0)) {
    while (l38 = a1, ((J) * (I*)(a2 + 0x10) & 0xffffffffU) <= a1 / l18) {
      l18 = l18 * ((J) * (I*)(a2 + 0x10) & 0xffffffffU);
    }
    while (l18 != 0) {
      uVar2 = l38 / l18;
      l38 = l38 % l18;
      l18 = l18 / ((J) * (I*)(a2 + 0x10) & 0xffffffffU);
      if ((I)uVar2 < 10) {
        cVar1 = '0';
      } else {
        if ((*a2 & 4) == 0) {
          cVar1 = 'W';
        } else {
          cVar1 = '7';
        }
      }
      *l20 = cVar1 + (C)uVar2;
      l20 = l20 + 1;
    }
    *(C**)(a2 + 0x20) = l20 + -*(J*)(a2 + 0x18);
  }
  R;
}

void fcn_88000288(J a1, J a2)
{
  J l18;

  l18 = a1;
  if (a1 < 0) {
    l18 = -a1;
    *(undef *)(a2 + 0xc) = 0x2d;
  }
  fcn_8800013c(l18, a2);
  R;
}

void fcn_880002e4(U a1, C*a2)
{
  C cVar1;
  U uVar2;
  U l38;
  C*l20;
  U l18;

  l18 = 1;
  l20 = *(C**)(a2 + 0x18);
  if ((*(I*)(a2 + 8) != 0) || (a1 != 0)) {
    while (l38 = a1, ((J) * (I*)(a2 + 0x10) & 0xffffffffU) <= a1 / l18) {
      l18 = l18 * ((J) * (I*)(a2 + 0x10) & 0xffffffffU);
    }
    while (l18 != 0) {
      uVar2 = l38 / l18;
      l38 = l38 % l18;
      l18 = l18 / ((J) * (I*)(a2 + 0x10) & 0xffffffffU);
      if ((I)uVar2 < 10) {
        cVar1 = '0';
      } else {
        if ((*a2 & 4) == 0) {
          cVar1 = 'W';
        } else {
          cVar1 = '7';
        }
      }
      *l20 = cVar1 + (C)uVar2;
      l20 = l20 + 1;
    }
    *(C**)(a2 + 0x20) = l20 + -*(J*)(a2 + 0x18);
  }
  R;
}

void fcn_88000430(J a1, J a2)
{
  J l18;

  l18 = a1;
  if (a1 < 0) {
    l18 = -a1;
    *(undef *)(a2 + 0xc) = 0x2d;
  }
  fcn_880002e4(l18, a2);
  R;
}

void fcn_8800048c(uI a1, C*a2)
{
  uI uVar1;
  C cVar2;
  uI l34;
  C*l20;
  uI l14;

  l14 = 1;
  l20 = *(C**)(a2 + 0x18);
  if ((*(I*)(a2 + 8) != 0) || (a1 != 0)) {
    while (l34 = a1, *(uI*)(a2 + 0x10) <= a1 / l14) {
      l14 = l14 * *(I*)(a2 + 0x10);
    }
    while (l14 != 0) {
      uVar1 = l34 / l14;
      l34 = l34 % l14;
      l14 = l14 / *(uI*)(a2 + 0x10);
      if ((I)uVar1 < 10) {
        cVar2 = '0';
      } else {
        if ((*a2 & 4) == 0) {
          cVar2 = 'W';
        } else {
          cVar2 = '7';
        }
      }
      *l20 = cVar2 + (C)uVar1;
      l20 = l20 + 1;
    }
    *(C**)(a2 + 0x20) = l20 + -*(J*)(a2 + 0x18);
  }
  R;
}

void fcn_880005d4(I a1, J a2)
{
  I l14;

  l14 = a1;
  if (a1 < 0) {
    l14 = -a1;
    *(undef *)(a2 + 0xc) = 0x2d;
  }
  fcn_8800048c((J)l14, a2);
  R;
}


J fcn_88000638(C a1)
{
  J lVar1;

  if ((a1 < 0x30) || (0x39 < a1)) {
    if ((a1 < 0x61) || (0x66 < a1)) {
      if ((a1 < 0x41) || (0x46 < a1)) {
        lVar1 = -1;
      } else {
        lVar1 = (J)(I)((uI)a1 - 0x37);
      }
    } else {
      lVar1 = (J)(I)((uI)a1 - 0x57);
    }
  } else {
    lVar1 = (J)(I)((uI)a1 - 0x30);
  }
  R lVar1;
}


U fcn_880006fc(C a1, C**a2, I a3, I*a4)
{
  I iVar1;
  C l21;
  I l1c;
  C*l18;

  l1c = 0;
  l21 = a1;
  l18 = *a2;
  while ((iVar1 = fcn_88000638((U)l21), -1 < iVar1 && (iVar1 <= a3))) {
    l1c = l1c * a3 + iVar1;
    l21 = *l18;
    l18 = l18 + 1;
  }
  *a2 = l18;
  *a4 = l1c;
  R(U) l21;
}


void fcn_880007d8(undef8 a1, U a2, C*a3)
{
  bool bVar1;
  I iVar2;
  undef8 uVar3;
  J l28;
  C*l20;
  I l18;
  I l14;

  l20 = *(C**)(a3 + 0x18);
  l28 = *(J*)(a3 + 0x20);
  l14 = *(I*)(a3 + 4) - (I)l28;
  l18 = *(I*)(a3 + 8) - (I)l28;
  if (a3[0xc] != 0) {
    l14 = l14 + -1;
  }
  if (((*a3 & 2) == 0) || (*(I*)(a3 + 0x10) != 0x10)) {
    if (((*a3 & 2) != 0) && (*(I*)(a3 + 0x10) == 8)) {
      l14 = l14 + -1;
    }
  } else {
    l14 = l14 + -2;
  }
  if (0 < l18) {
    l14 = l14 - l18;
  }
  if (((*a3 & 1) == 0) && ((*a3 & 8) == 0)) {
    while (iVar2 = l14 + -1, bVar1 = 0 < l14, l14 = iVar2, bVar1) {
      (*(code *)(a2 & 0xfffffffffffffffe))(a1, 0x20);
    }
  }
  if (a3[0xc] != 0) {
    (*(code *)(a2 & 0xfffffffffffffffe))(a1, (U)a3[0xc]);
  }
  if (((*a3 & 2) == 0) || (*(I*)(a3 + 0x10) != 0x10)) {
    if (((*a3 & 2) != 0) && (*(I*)(a3 + 0x10) == 8)) {
      (*(code *)(a2 & 0xfffffffffffffffe))(a1, 0x30);
    }
  } else {
    (*(code *)(a2 & 0xfffffffffffffffe))(a1, 0x30);
    if ((*a3 & 4) == 0) {
      uVar3 = 0x78;
    } else {
      uVar3 = 0x58;
    }
    (*(code *)(a2 & 0xfffffffffffffffe))(a1, uVar3);
  }
  while (0 < l18) {
    (*(code *)(a2 & 0xfffffffffffffffe))(a1, 0x30);
    l18 = l18 + -1;
  }
  if ((*a3 & 1) != 0) {
    while (iVar2 = l14 + -1, bVar1 = 0 < l14, l14 = iVar2, bVar1) {
      (*(code *)(a2 & 0xfffffffffffffffe))(a1, 0x30);
    }
  }
  while (l28 != 0) {
    if (*l20 == 0) break;
    (*(code *)(a2 & 0xfffffffffffffffe))(a1, (U)*l20);
    l28 = l28 + -1;
    l20 = l20 + 1;
  }
  if (((*a3 & 1) == 0) && ((*a3 & 8) != 0)) {
    while (0 < l14) {
      (*(code *)(a2 & 0xfffffffffffffffe))(a1, 0x20);
      l14 = l14 + -1;
    }
  }
  R;
}


void tfp_format(undef8 a1, U a2, C*a3, C**a4)
{
  C cVar1;
  C*pbVar2;
  C**ppcVar3;
  C*pcVar4;
  C**l90;
  C*l88;
  U l80;
  undef8 l78;
  I l70;
  I l6c;
  C acStack104[24];
  C l50[4];
  I l4c;
  I l48;
  undef l44;
  undef4 l40;
  C*l38;
  J l30;
  I l24;
  C*l20;
  I l18;
  C l12;
  C l11;

  l90 = a4;
  l88 = a3;
  l80 = a2;
  l78 = a1;
LAB_880012a8:
  while (true) {
    l11 = *l88;
    if (l11 == 0) {
      R;
    }
    if (l11 == 0x25) break;
    l88 = l88 + 1;
    (*(code *)(l80 & 0xfffffffffffffffe))(l78, (U)l11);
  }
  l12 = '\0';
  l50[0] = l50[0] & 0xf0;
  l4c = 0;
  l48 = -1;
  l44 = 0;
  l38 = acStack104;
  l30 = 0;
  l88 = l88 + 1;
  while (true) {
    pbVar2 = l88 + 1;
    l11 = *l88;
    if (l11 == 0) break;
    if (l11 == 0x2d) {
      l50[0] = l50[0] | 8;
      l88 = pbVar2;
    } else {
      if (l11 == 0x30) {
        l50[0] = l50[0] | 1;
        l88 = pbVar2;
      } else {
        if (l11 != 0x23) break;
        l50[0] = l50[0] | 2;
        l88 = pbVar2;
      }
    }
  }
  if ((l50[0] & 8) != 0) {
    l50[0] = l50[0] & 0xfe;
  }
  if (l11 == 0x2a) {
    l88 = l88 + 2;
    l11 = *pbVar2;
    ppcVar3 = l90 + 1;
    l4c = *(I*)l90;
    l90 = ppcVar3;
    if (l4c < 0) {
      l50[0] = l50[0] | 8;
      l4c = -l4c;
    }
  } else {
    l88 = pbVar2;
    if ((0x2f < l11) && (l11 < 0x3a)) {
      l11 = fcn_880006fc((U)l11, &l88, 10, &l6c);
      l4c = l6c;
    }
  }
  if (l11 == 0x2e) {
    pbVar2 = l88 + 1;
    l11 = *l88;
    if (l11 == 0x2a) {
      l88 = l88 + 2;
      l11 = *pbVar2;
      ppcVar3 = l90 + 1;
      l24 = *(I*)l90;
      l90 = ppcVar3;
      l48 = l24;
      if (l24 < 0) {
        l48 = -1;
      }
    } else {
      l88 = pbVar2;
      if ((l11 < 0x30) || (0x39 < l11)) {
        l48 = 0;
      } else {
        l11 = fcn_880006fc((U)l11, &l88, 10, &l70);
        l48 = l70;
      }
    }
  }
  if (-1 < l48) {
    l50[0] = l50[0] & 0xfe;
  }
  if (l11 == 0x7a) {
    l11 = *l88;
    l12 = '\x01';
    pbVar2 = l88 + 1;
  } else {
    pbVar2 = l88;
    if (l11 == 0x6c) {
      l11 = *l88;
      l12 = '\x01';
      pbVar2 = l88 + 1;
      if (l11 == 0x6c) {
        l11 = l88[1];
        l12 = '\x02';
        pbVar2 = l88 + 2;
      }
    }
  }
  l88 = pbVar2;
  if (l11 == 0x69) {
  LAB_88000fe4:
    l40 = 10;
    if (l48 < 0) {
      l48 = 1;
    }
    if (l12 == '\x02') {
      fcn_88000288(*l90, l50);
    } else {
      if (l12 == '\x01') {
        fcn_88000430(*l90, l50);
      } else {
        fcn_880005d4((J) * (I*)l90, l50);
      }
    }
    l90 = l90 + 1;
    fcn_880007d8(l78, l80, l50);
    goto LAB_880012a8;
  }
  if (l11 < 0x6a) {
    if (l11 != 0x58) {
      if (l11 < 0x59) {
        if (l11 == 0) {
          R;
        }
        if (l11 == 0x25) {
          (*(code *)(l80 & 0xfffffffffffffffe))(l78, 0x25);
        }
      } else {
        if (l11 == 99) {
          (*(code *)(l80 & 0xfffffffffffffffe))(l78, (J) * (I*)l90 & 0xff);
          l90 = l90 + 1;
        } else {
          if (l11 == 100) goto LAB_88000fe4;
        }
      }
      goto LAB_880012a8;
    }
  } else {
    if (l11 == 0x73) {
      l18 = l48;
      l38 = *l90;
      l20 = l38;
      while ((l18 != 0 &&
              (pcVar4 = l20 + 1, cVar1 = *l20, l20 = pcVar4, cVar1 != '\0'))) {
        l30 = l30 + 1;
        l18 = l18 + -1;
      }
      l48 = -1;
      l18 = l18 + -1;
      fcn_880007d8(l78, l80, l50);
      l90 = l90 + 1;
      goto LAB_880012a8;
    }
    if (0x73 < l11) {
      if (l11 == 0x75) {
        l40 = 10;
        if (l48 < 0) {
          l48 = 1;
        }
        if (l12 == '\x02') {
          fcn_8800013c(*l90, l50);
        } else {
          if (l12 == '\x01') {
            fcn_880002e4(*l90, l50);
          } else {
            fcn_8800048c((J) * (I*)l90, l50);
          }
        }
        l90 = l90 + 1;
        fcn_880007d8(l78, l80, l50);
      } else {
        if (l11 == 0x78) goto LAB_880010b0;
      }
      goto LAB_880012a8;
    }
    if (l11 == 0x6f) {
      l40 = 8;
      if (l48 < 0) {
        l48 = 1;
      }
      fcn_8800048c((J) * (I*)l90, l50);
      fcn_880007d8(l78, l80, l50);
      l90 = l90 + 1;
      goto LAB_880012a8;
    }
    if (l11 != 0x70) goto LAB_880012a8;
    l50[0] = l50[0] | 2;
    l12 = '\x01';
  }
LAB_880010b0:
  l40 = 0x10;
  l50[0] = l50[0] & 0xfb | (l11 == 0x58) << 2;
  if (l48 < 0) {
    l48 = 1;
  }
  if (l12 == '\x02') {
    fcn_8800013c(*l90, l50);
  } else {
    if (l12 == '\x01') {
      fcn_880002e4(*l90, l50);
    } else {
      fcn_8800048c((J) * (I*)l90, l50);
    }
  }
  l90 = l90 + 1;
  fcn_880007d8(l78, l80, l50);
  goto LAB_880012a8;
}


J tfp_vsnprintf(J a1, J a2, undef8 a3, undef8 a4)
{
  J lVar1;
  U l28;
  J l20;
  U l18;

  if (a2 == 0) {
    lVar1 = 0;
  } else {
    l28 = a2 - 1;
    l18 = 0;
    l20 = a1;
    tfp_format(&l28, &LAB_880013a4, a3, a4);
    if (l18 < l28) {
      *(undef *)(l20 + l18) = 0;
    } else {
      *(undef *)(l20 + l28) = 0;
    }
    lVar1 = (J)(I)l18;
  }
  R lVar1;
}


