laanwj/k210-sdk-stuff/rom/k210.rom.c
J tfp_vsprintf(J a1, undef8 a2, undef8 a3)
{
  J l20;
  J l18;

  l18 = 0;
  l20 = a1;
  tfp_format(&l20, &LAB_8800153c, a2, a3);
  *(undef *)(l20 + l18) = 0;
  R(J)(I) l18;
}


J tfp_sprintf(undef8 a1, undef8 a2, undef8 a3, undef8 a4,
            undef8 a5, undef8 a6, undef8 a7, undef8 a8)
{
  I iVar1;
  undef8 l30;
  undef8 uStack40;
  undef8 uStack32;
  undef8 uStack24;
  undef8 uStack16;
  undef8 uStack8;

  l30 = a3;
  uStack40 = a4;
  uStack32 = a5;
  uStack24 = a6;
  uStack16 = a7;
  uStack8 = a8;
  iVar1 = tfp_vsprintf(a1, a2, &l30);
  R(J) iVar1;
}


undef8 printk(undef8 a1, undef8 a2, undef8 a3, undef8 a4,
                undef8 a5, undef8 a6, undef8 a7, undef8 a8)
{
  undef8 uStack56;
  undef8 uStack48;
  undef8 uStack40;
  undef8 uStack32;
  undef8 uStack24;
  undef8 uStack16;
  undef8 uStack8;

  uStack56 = a2;
  uStack48 = a3;
  uStack40 = a4;
  uStack32 = a5;
  uStack24 = a6;
  uStack16 = a7;
  uStack8 = a8;
  tfp_format(_DAT_805fc008, &LAB_88001674, a1, &uStack56);
  R 0;
}


void panic_printf(undef8 *a1, undef8 a2, undef8 a3, J a4)
{
  J lVar1;
  J in_mhartid;
  undef8 *l48;
  undef8 l38[2];
  J l28;
  J l20;
  I l18;
  I l14;

  l38[0] = s_unknown_8800b9d0;
  l48 = a1;
  if (a1 == (undef8 *)0x0) {
    l48 = l38;
  }
  l20 = 0x805fb800;
  l28 = 0x805fbc00;
  if (in_mhartid == 0) {
    tfp_sprintf(0x805fb800, s_Cause_0x_016lx__EPC_0x_016lx__Co_8800b938, a2, a3);
    l14 = 0;
    while (l14 < 0x10) {
      lVar1 = strlen(l20);
      tfp_sprintf(l20 + lVar1, s_reg__02d___s____0x_016lx__reg__0_8800b960,
                (J)(l14 << 1), (&PTR_s_zero_8800bc38)[(J)(l14 << 1) * 2],
                *(undef8 *)(a4 + (J)l14 * 0x10), (J)(l14 * 2 + 1),
                (&PTR_s_zero_8800bc38)[(J)(l14 * 2 + 1) * 2],
                *(undef8 *)(a4 + (J)l14 * 0x10 + 8));
      l14 = l14 + 1;
    }
    lVar1 = strlen(l20);
    tfp_sprintf(l20 + lVar1, s_Reason___s_8800b998, l48);
    uarths_puts(l20);
  } else {
    tfp_sprintf(0x805fbc00, s_Cause_0x_016lx__EPC_0x_016lx__Co_8800b9a8, a2, a3);
    l18 = 0;
    while (l18 < 0x10) {
      lVar1 = strlen(l28);
      tfp_sprintf(l28 + lVar1, s_reg__02d___s____0x_016lx__reg__0_8800b960,
                (J)(l18 << 1), (&PTR_s_zero_8800bc38)[(J)(l18 << 1) * 2],
                *(undef8 *)(a4 + (J)l18 * 0x10), (J)(l18 * 2 + 1),
                (&PTR_s_zero_8800bc38)[(J)(l18 * 2 + 1) * 2],
                *(undef8 *)(a4 + (J)l18 * 0x10 + 8));
      l18 = l18 + 1;
    }
    lVar1 = strlen(l28);
    tfp_sprintf(l28 + lVar1, s_Reason___s_8800b998, l48);
  }
  R;
}


void exit(I a1)
{
  J in_mhartid;

  if (in_mhartid == 0) {
    printk(s_Ieresting__something_s_wrong__b_8800b9d8, (J)a1);
  }
  do {
    // WARNING: Do nothing block with infinite loop
  } while (true);
}


undef8 panic_handler_internal(undef8 a1, uI3 *a2, U a3, J a4, I a5,
                                undef4 a6, uI a7)
{
  I iVar1;
  uI uVar2;
  uI3 *puVar3;
  J lVar4;
  U extraout_a1;
  C bVar5;
  C bVar6;
  C bVar7;
  uI uStack88;
  I iStack68;
  uI uStack48;

  panic_printf(s_fuck_the_chip_is_dead__8800ba30, a1);
  puVar3 = (uI3 *)exit(0x29a);
  bVar5 = (C)extraout_a1;
  bVar6 = (C)a3;
  uStack88 = 0;
  if ((a5 == 0) || (a5 == 1)) {
    uStack48 = uStack48 + 0xf & 0xfffffff0;
  }
  _DAT_50450028 = _DAT_50450028 | 1;
  iStack68 = 0;
  while (iStack68 < (I)(uI)(bVar5 >> 2)) {
    *(undef4 *)((J)iStack68 * 4 + 0x50450000) =
        *(undef4 *)((J)puVar3 + (J)(I)((uI)bVar5 + iStack68 * -4) + -4);
    iStack68 = iStack68 + 1;
  }
  bVar7 = bVar5 & 3;
  if ((extraout_a1 & 3) != 0) {
    if (bVar7 == 2) {
      uStack88 = (uI) * (ushort *)puVar3;
    } else {
      if (bVar7 == 3) {
        uStack88 = (uI)*puVar3;
      } else {
        if (bVar7 == 1) {
          uStack88 = (uI) * (C*)puVar3;
        }
      }
    }
    *(uI*)((J)(I)(uI)(bVar5 >> 2) * 4 + 0x50450000) = uStack88;
  }
  iStack68 = 0;
  while (iStack68 < (I)(uI)(bVar6 >> 2)) {
    *(undef4 *)(((J)iStack68 + 4) * 4 + 0x50450008) =
        *(undef4 *)((J)a2 + (J)(I)((uI)bVar6 + iStack68 * -4) + -4);
    iStack68 = iStack68 + 1;
  }
  bVar5 = bVar6 & 3;
  if ((a3 & 3) != 0) {
    if (bVar5 == 2) {
      uStack88 = uStack88 & 0xffff0000 | (uI) * (ushort *)a2;
    } else {
      if (bVar5 == 3) {
        uStack88 = (uI)*a2;
      } else {
        if (bVar5 == 1) {
          uStack88 = uStack88 & 0xffffff00 | (uI) * (C*)a2;
        }
      }
    }
    *(uI*)(((J)(I)(uI)(bVar6 >> 2) + 4) * 4 + 0x50450008) = uStack88;
  }
  _DAT_50450034 = a7 - 1;
  _DAT_5045003c = uStack48 - 1;
  _DAT_50450064 = _DAT_50450064 | 1;
  _DAT_50450010 = a6;
  _DAT_50450014 = a5;
  if (a5 == 3) {
    iStack68 = 0;
    while (iStack68 < (I)(a7 >> 2)) {
      iVar1 = *(I*)(a4 + (iStack68 << 2));
      do {
        lVar4 = aes_get_data_in_flag();
      } while (lVar4 == 0);
      aes_write_aad((J)iVar1);
      iStack68 = iStack68 + 1;
    }
    uVar2 = a7 & 0xfffffffc;
    a7 = a7 & 3;
    if (a7 != 0) {
      if (a7 == 2) {
        uStack88._0_2_ = CONCAT11(*(undef *)(a4 + (J)(I)uVar2 + 1),
                                  *(undef *)(a4 + (I)uVar2));
        uStack88 = uStack88 & 0xffff0000 | (uI)(ushort)uStack88;
      } else {
        if (a7 == 3) {
          uStack88._0_2_ = CONCAT11(*(undef *)(a4 + (J)(I)uVar2 + 1),
                                    *(undef *)(a4 + (I)uVar2));
          uStack88._0_3_ =
              CONCAT12(*(undef *)(a4 + (J)(I)uVar2 + 2), (ushort)uStack88);
          uStack88 = (uI)(uI3)uStack88;
        } else {
          if (a7 != 1) {
            R 0;
          }
          uStack88 = uStack88 & 0xffffff00 | (uI) * (C*)(a4 + (I)uVar2);
        }
      }
      do {
        lVar4 = aes_get_data_in_flag();
      } while (lVar4 == 0);
      aes_write_aad((J)(I)uStack88);
    }
  }
  R 1;
}


undef8 aes_init(uI3 *a1, C a2, uI3 *a3, C a4, J a5, I a6, undef4 a7,
                    uI a8)
{
  I iVar1;
  uI uVar2;
  J lVar3;
  C bVar4;
  uI in_stack_00000000;
  uI l28;
  I l14;

  l28 = 0;
  if ((a6 == 0) || (a6 == 1)) {
    in_stack_00000000 = in_stack_00000000 + 0xf & 0xfffffff0;
  }
  _DAT_50450028 = _DAT_50450028 | 1;
  l14 = 0;
  while (l14 < (I)(uI)(a2 >> 2)) {
    *(undef4 *)((J)l14 * 4 + 0x50450000) =
        *(undef4 *)((J)a1 + (J)(I)((uI)a2 + l14 * -4) + -4);
    l14 = l14 + 1;
  }
  bVar4 = a2 & 3;
  if ((a2 & 3) != 0) {
    if (bVar4 == 2) {
      l28 = (uI) * (ushort *)a1;
    } else {
      if (bVar4 == 3) {
        l28 = (uI)*a1;
      } else {
        if (bVar4 == 1) {
          l28 = (uI) * (C*)a1;
        }
      }
    }
    *(uI*)((J)(I)(uI)(a2 >> 2) * 4 + 0x50450000) = l28;
  }
  l14 = 0;
  while (l14 < (I)(uI)(a4 >> 2)) {
    *(undef4 *)(((J)l14 + 4) * 4 + 0x50450008) =
        *(undef4 *)((J)a3 + (J)(I)((uI)a4 + l14 * -4) + -4);
    l14 = l14 + 1;
  }
  bVar4 = a4 & 3;
  if ((a4 & 3) != 0) {
    if (bVar4 == 2) {
      l28 = l28 & 0xffff0000 | (uI) * (ushort *)a3;
    } else {
      if (bVar4 == 3) {
        l28 = (uI)*a3;
      } else {
        if (bVar4 == 1) {
          l28 = l28 & 0xffffff00 | (uI) * (C*)a3;
        }
      }
    }
    *(uI*)(((J)(I)(uI)(a4 >> 2) + 4) * 4 + 0x50450008) = l28;
  }
  _DAT_50450034 = a8 - 1;
  _DAT_5045003c = in_stack_00000000 - 1;
  _DAT_50450064 = _DAT_50450064 | 1;
  _DAT_50450010 = a7;
  _DAT_50450014 = a6;
  if (a6 == 3) {
    l14 = 0;
    while (l14 < (I)(a8 >> 2)) {
      iVar1 = *(I*)(a5 + (l14 << 2));
      do {
        lVar3 = aes_get_data_in_flag();
      } while (lVar3 == 0);
      aes_write_aad((J)iVar1);
      l14 = l14 + 1;
    }
    uVar2 = a8 & 0xfffffffc;
    a8 = a8 & 3;
    if (a8 != 0) {
      if (a8 == 2) {
        l28._0_2_ = CONCAT11(*(undef *)(a5 + (J)(I)uVar2 + 1),
                             *(undef *)(a5 + (I)uVar2));
        l28 = l28 & 0xffff0000 | (uI)(ushort)l28;
      } else {
        if (a8 == 3) {
          l28._0_2_ = CONCAT11(*(undef *)(a5 + (J)(I)uVar2 + 1),
                               *(undef *)(a5 + (I)uVar2));
          l28._0_3_ =
              CONCAT12(*(undef *)(a5 + (J)(I)uVar2 + 2), (ushort)l28);
          l28 = (uI)(uI3)l28;
        } else {
          if (a8 != 1) {
            R 0;
          }
          l28 = l28 & 0xffffff00 | (uI) * (C*)(a5 + (I)uVar2);
        }
      }
      do {
        lVar3 = aes_get_data_in_flag();
      } while (lVar3 == 0);
      aes_write_aad((J)(I)l28);
    }
  }
  R 1;
}


undef8 aes_write_aad(undef4 a1)
{
  _DAT_50450044 = a1;
  R 0;
}


