laanwj/k210-sdk-stuff/rom/k210.rom.c
undef8 aes_write_text(undef4 a1)
{
  _DAT_50450040 = a1;
  R 0;
}


undef8 gcm_write_tag(undef4 *a1)
{
  _DAT_50450050 = a1[3];
  _DAT_50450054 = a1[2];
  _DAT_50450058 = a1[1];
  _DAT_5045005c = *a1;
  R 0;
}


J aes_get_data_in_flag(void)
{
  R(J) _DAT_5045004c;
}


J fcn_8800208c_aes(void)
{
  R(J) _DAT_50450068;
}


J gcm_get_tag_in_flag(void)
{
  R(J) _DAT_5045006c;
}


J aes_read_out_data(void)
{
  R(J) _DAT_50450060;
}


J gcm_get_tag_chk(void)
{
  R(J) _DAT_50450048;
}


undef8 FUN_88002138(undef *a1)
{
  undef4 uVar1;

  uVar1 = _DAT_50450080;
  *a1 = (C)((uI)_DAT_50450080 >> 0x18);
  a1[1] = (C)((uI)uVar1 >> 0x10);
  a1[2] = (C)((uI)uVar1 >> 8);
  a1[3] = (C)uVar1;
  uVar1 = _DAT_5045007c;
  a1[4] = (C)((uI)_DAT_5045007c >> 0x18);
  a1[5] = (C)((uI)uVar1 >> 0x10);
  a1[6] = (C)((uI)uVar1 >> 8);
  a1[7] = (C)uVar1;
  uVar1 = _DAT_50450078;
  a1[8] = (C)((uI)_DAT_50450078 >> 0x18);
  a1[9] = (C)((uI)uVar1 >> 0x10);
  a1[10] = (C)((uI)uVar1 >> 8);
  a1[0xb] = (C)uVar1;
  uVar1 = _DAT_50450074;
  a1[0xc] = (C)((uI)_DAT_50450074 >> 0x18);
  a1[0xd] = (C)((uI)uVar1 >> 0x10);
  a1[0xe] = (C)((uI)uVar1 >> 8);
  a1[0xf] = (C)uVar1;
  R 1;
}



undef8 gcm_clear_chk_tag(void)
{
  _DAT_50450070 = 0;
  R 0;
}


undef8 aes_process(J a1, J a2, uI a3, I a4)
{
  I iVar1;
  uI uVar2;
  undef4 uVar3;
  J lVar4;
  uI uVar5;
  uI uVar6;
  undef4 l40;
  I l28;
  uI l24;

  uVar5 = a3 + 0xf & 0xfffffff0;
  l24 = a3 >> 2;
  l28 = 0;
  while (l28 < (I)l24) {
    iVar1 = *(I*)(a1 + (l28 << 2));
    do {
      lVar4 = aes_get_data_in_flag();
    } while (lVar4 == 0);
    aes_write_text((J)iVar1);
    l28 = l28 + 1;
  }
  uVar2 = a3 & 0xfffffffc;
  uVar6 = a3 & 3;
  if (uVar6 != 0) {
    if (uVar6 == 2) {
      l40._0_2_ = CONCAT11(*(undef *)(a1 + (J)(I)uVar2 + 1),
                           *(undef *)(a1 + (I)uVar2));
      l40 = (uI)(ushort)l40;
    } else {
      if (uVar6 == 3) {
        l40._0_2_ = CONCAT11(*(undef *)(a1 + (J)(I)uVar2 + 1),
                             *(undef *)(a1 + (I)uVar2));
        l40._0_3_ = CONCAT12(*(undef *)(a1 + (J)(I)uVar2 + 2), (ushort)l40);
        l40 = (uI)(uI3)l40;
      } else {
        if (uVar6 != 1) {
          R 0;
        }
        l40 = (uI) * (C*)(a1 + (I)uVar2);
      }
    }
    do {
      lVar4 = aes_get_data_in_flag();
    } while (lVar4 == 0);
    aes_write_text((J)(I)l40);
  }
  if ((a4 == 0) || (a4 == 1)) {
    l28 = 0;
    while (l28 < (I)(uVar5 - a3 >> 2)) {
      do {
        lVar4 = aes_get_data_in_flag();
      } while (lVar4 == 0);
      aes_write_text(0);
      l28 = l28 + 1;
    }
    l24 = (I)(((uI)((I)(a3 + 0xf) >> 0x1f) >> 0x1e) + uVar5) >> 2;
  }
  l28 = 0;
  while (l28 < (I)l24) {
    do {
      lVar4 = fcn_8800208c_aes();
    } while (lVar4 == 0);
    uVar3 = aes_read_out_data();
    *(undef4 *)(a2 + (l28 << 2)) = uVar3;
    l28 = l28 + 1;
  }
  if ((a4 == 3) && (uVar6 != 0)) {
    do {
      lVar4 = fcn_8800208c_aes();
    } while (lVar4 == 0);
    uVar3 = aes_read_out_data();
    l40._0_1_ = (undef)uVar3;
    l40._1_1_ = (undef)((uI)uVar3 >> 8);
    if (uVar6 == 2) {
      *(undef *)(a2 + (I)(l24 << 2)) = (undef)l40;
      *(undef *)(a2 + (J)(l28 << 2) + 1) = l40._1_1_;
    } else {
      if (uVar6 == 3) {
        *(undef *)(a2 + (I)(l24 << 2)) = (undef)l40;
        *(undef *)(a2 + (J)(l28 << 2) + 1) = l40._1_1_;
        l40._2_1_ = (undef)((uI)uVar3 >> 0x10);
        *(undef *)(a2 + (J)(l28 << 2) + 2) = l40._2_1_;
      } else {
        if (uVar6 != 1) {
          R 0;
        }
        *(undef *)(a2 + (I)(l24 << 2)) = (undef)l40;
      }
    }
  }
  R 1;
}


undef8 aes_process_outer(J a1, J a2, uI a3, I a4)
{
  uI l14;

  l14 = 0;
  if (0x4f < a3) {
    l14 = 0;
    while (l14 < a3 / 0x50) {
      aes_process(a1 + ((J)(I)(l14 * 0x50) & 0xffffffffU),
                  a2 + ((J)(I)(l14 * 0x50) & 0xffffffffU), 0x50, (J)a4);
      l14 = l14 + 1;
    }
  }
  if (a3 % 0x50 != 0) {
    aes_process(a1 + ((J)(I)(l14 * 0x50) & 0xffffffffU),
                a2 + ((J)(I)(l14 * 0x50) & 0xffffffffU), (J)(I)(a3 % 0x50),
                (J)a4);
  }
  R 1;
}



undef8 clint_ipi_send(U a1)
{
  uI*puVar1;
  undef8 uVar2;

  if (a1 < 2) {
    puVar1 = (uI*)(a1 * 4 + 0x2000000);
    *puVar1 = *puVar1 | 1;
    uVar2 = 0;
  } else {
    uVar2 = 0xffffffffffffffff;
  }
  R uVar2;
}


undef8 fpioa_init(void)
{
  uI uVar1;
  J lVar2;
  undef8 l58;
  undef8 l50;
  undef8 l48;
  undef8 l40;
  undef8 l38;
  undef8 l30;
  undef8 l28;
  undef8 l20;
  I l14;

  l14 = 0;
  sysctl_clock_enable(0x1d);
  l58 = 0;
  l50 = 0;
  l48 = 0;
  l40 = 0;
  l38 = 0;
  l30 = 0;
  l28 = 0;
  l20 = 0;
  l14 = 0;
  while (l14 < 0x100) {
    uVar1 = l14 >> 0x1f;
    lVar2 = (J)((I)((uVar1 >> 0x1b) + l14) >> 5);
    *(uI*)((J)&l58 + lVar2 * 4) =
        *(uI*)((J)&l58 + lVar2 * 4) |
        (*(uI*)(&DAT_8800b4c0 + (J)l14 * 4) >> 0x18 & 1)
            << ((J)(I)((l14 + (uVar1 >> 0x1b) & 0x1f) - (uVar1 >> 0x1b)) &
                0x1fU);
    lVar2 = (J)((I)((uVar1 >> 0x1b) + l14) >> 5);
    *(uI*)((J)&l58 + (lVar2 + 8) * 4) =
        *(uI*)((J)&l58 + (lVar2 + 8) * 4) |
        (*(uI*)(&DAT_8800b4c0 + (J)l14 * 4) >> 0x19 & 1)
            << ((J)(I)((l14 + (uVar1 >> 0x1b) & 0x1f) - (uVar1 >> 0x1b)) &
                0x1fU);
    l14 = l14 + 1;
  }
  l14 = 0;
  while (l14 < 8) {
    *(undef4 *)(((J)l14 + 0x38) * 4 + 0x502b0000) =
        *(undef4 *)((J)&l58 + ((J)l14 + 8) * 4);
    *(undef4 *)(((J)l14 + 0x30) * 4 + 0x502b0000) =
        *(undef4 *)((J)&l58 + (J)l14 * 4);
    l14 = l14 + 1;
  }
  R 0;
}


undef8 fpioa_set_function_raw(I a1, uI a2)
{
  undef8 uVar1;

  if (((a1 < 0) || (0x2f < a1)) || (0xff < a2)) {
    uVar1 = 0xffffffffffffffff;
  } else {
    *(uI*)((J)a1 * 4 + 0x502b0000) =
        (uI)(C)(&DAT_8800b4c0)[(U)a2 * 4] |
        (*(uI*)(&DAT_8800b4c0 + (U)a2 * 4) >> 8 & 0xf) << 8 |
        (*(uI*)(&DAT_8800b4c0 + (U)a2 * 4) >> 0xc & 1) << 0xc |
        (*(uI*)(&DAT_8800b4c0 + (U)a2 * 4) >> 0xd & 1) << 0xd |
        (*(uI*)(&DAT_8800b4c0 + (U)a2 * 4) >> 0xe & 1) << 0xe |
        (*(uI*)(&DAT_8800b4c0 + (U)a2 * 4) >> 0xf & 1) << 0xf |
        (*(uI*)(&DAT_8800b4c0 + (U)a2 * 4) >> 0x10 & 1) << 0x10 |
        (*(uI*)(&DAT_8800b4c0 + (U)a2 * 4) >> 0x11 & 1) << 0x11 |
        (*(uI*)(&DAT_8800b4c0 + (U)a2 * 4) >> 0x12 & 1) << 0x12 |
        (*(uI*)(&DAT_8800b4c0 + (U)a2 * 4) >> 0x13 & 1) << 0x13 |
        (*(uI*)(&DAT_8800b4c0 + (U)a2 * 4) >> 0x14 & 1) << 0x14 |
        (*(uI*)(&DAT_8800b4c0 + (U)a2 * 4) >> 0x15 & 1) << 0x15 |
        (*(uI*)(&DAT_8800b4c0 + (U)a2 * 4) >> 0x16 & 1) << 0x16 |
        (*(uI*)(&DAT_8800b4c0 + (U)a2 * 4) >> 0x17 & 1) << 0x17;
    uVar1 = 0;
  }
  R uVar1;
}


undef8 fpioa_set_function(uI a1, uI a2)
{
  undef8 uVar1;
  C l11;

  if ((((I)a1 < 0) || (0x2f < (I)a1)) || (0xff < a2)) {
    uVar1 = 0xffffffffffffffff;
  } else {
    if (a2 == 0x78) {
      fpioa_set_function_raw((J)(I)a1, 0x78);
      uVar1 = 0;
    } else {
      l11 = 0;
      while (l11 < 0x30) {
        if ((a2 == (*(uI*)((J)(I)(uI)l11 * 4 + 0x502b0000) & 0xff)) &&
            (a1 != (uI)l11)) {
          fpioa_set_function_raw((J)(I)(uI)l11, 0x78);
        }
        l11 = l11 + 1;
      }
      fpioa_set_function_raw((J)(I)a1, (J)(I)a2);
      uVar1 = 0;
    }
  }
  R uVar1;
}


void otp_reset(C a1)
{
  sysctl_clock_enable(0x24);
  _DAT_5042000c = 0;
  _DAT_50420028 = 0;
  _DAT_50420044 = (uI)a1;
  _DAT_5042005c = 0;
  _DAT_50420078 = 0;
  _DAT_5042007c = 1;
  _DAT_50420080 = 1;
  _DAT_50420084 = 0;
  _DAT_50420088 = 0;
  _DAT_5042008c = 0;
  _DAT_50420090 = 0;
  _DAT_50420094 = 0;
  _DAT_50420098 = 0;
  _DAT_5042009c = 0;
  _DAT_504200a0 = 1;
  _DAT_504200a4 = 0;
  _DAT_504200a8 = 0;
  R;
}


void otp_set_0c(void)
{
  _DAT_5042000c = 1;
  R;
}


