laanwj/k210-sdk-stuff/rom/k210.rom.c
void otp_clear_0c(void)
{
  _DAT_5042000c = 0;
  R;
}


undef8 otp_check_fuse_a_bit(uI a1)
{
  undef8 uVar1;

  if ((a1 & _DAT_50420068) == 0) {
    uVar1 = 0x10;
  } else {
    uVar1 = 0xf;
  }
  R uVar1;
}


undef8 otp_clear_state18(void)
{
  uI l14;

  l14 = 0;
  do {
    if (_DAT_50420048 != 0) {
      if (_DAT_50420064 != 0) {
        _DAT_50420000 = 0;
        _DAT_50420004 = 0x30;
        _DAT_50420008 = 2;
        _DAT_50420018 = 0;
        _DAT_50420048 = 0;
        _DAT_50420058 = 1;
        R 5;
      }
      _DAT_50420000 = 0;
      _DAT_50420004 = 0x30;
      _DAT_50420008 = 2;
      _DAT_50420018 = 0;
      _DAT_50420048 = 0;
      _DAT_50420058 = 1;
      R 0;
    }
    l14 = l14 + 1;
  } while (l14 < 0xffffff);
  _DAT_50420000 = 0;
  _DAT_50420004 = 0x30;
  _DAT_50420008 = 2;
  _DAT_50420018 = 0;
  _DAT_50420058 = 1;
  R 1;
}


undef8 otp_set_state18(void)
{
  uI l14;

  l14 = 0;
  do {
    if (_DAT_50420048 != 0) {
      _DAT_50420000 = 0;
      _DAT_50420004 = 0x30;
      _DAT_50420008 = 2;
      _DAT_50420018 = 1;
      _DAT_50420048 = 0;
      _DAT_50420058 = 1;
      R 0;
    }
    l14 = l14 + 1;
  } while (l14 < 0xffffff);
  _DAT_50420000 = 0;
  _DAT_50420004 = 0x30;
  _DAT_50420008 = 2;
  _DAT_50420018 = 1;
  _DAT_50420058 = 1;
  R 1;
}


J fcn_880042c0_otp(undef8 a1, C*a2, undef8 a3)
{
  I iVar1;
  C*l30;
  I l28;
  I l24;
  uI l18;
  C l12;
  C l11;

  _DAT_50420058 = 0;
  _DAT_50420008 = 1;
  _DAT_50420060 = 0;
  _DAT_50420000 = 0;
  l12 = '\0';
  l24 = (I)a1 << 3;
  l11 = *a2;
  l30 = a2 + 1;
  l28 = (I)a3 << 3;
  while (true) {
    _DAT_50420038 = 0;
    iVar1 = l28 + -1;
    if (l28 == 0) break;
    if ((iVar1 == 0) || ((l11 & 1) != 0)) {
      l18 = 0;
      do {
        if (_DAT_5042003c != 0) {
          if (iVar1 == 0) {
            _DAT_5042002c = (uI)l11 & 1;
            _DAT_50420020 = 1;
          } else {
            _DAT_5042002c = 1;
          }
          l18 = 0;
          do {
            l18 = l18 + 1;
          } while (l18 < 0xffffff);
          _DAT_50420000 = 0;
          _DAT_50420008 = 1;
          _DAT_50420010 = 1;
          _DAT_50420030 = l24;
          _DAT_50420038 = 0;
          _DAT_50420058 = 0;
          _DAT_50420060 = 0;
          R 1;
        }
        l18 = l18 + 1;
      } while (l18 < 0xffffff);
      _DAT_50420000 = 0;
      _DAT_50420008 = 1;
      _DAT_50420038 = 0;
      _DAT_50420058 = 0;
      _DAT_50420060 = 0;
      R 1;
    }
    l11 = l11 >> 1;
    l24 = l24 + 1;
    l12 = l12 + '\x01';
    l28 = iVar1;
    if (l12 == '\b') {
      l12 = '\0';
      l11 = *l30;
      l30 = l30 + 1;
    }
  }
  iVar1 = otp_clear_state18();
  if (iVar1 != 0) {
    R(J) iVar1;
  }
  iVar1 = otp_set_state18();
  if (iVar1 != 0) {
    R(J) iVar1;
  }
  R 0;
}


undef8 otp_read_inner(I a1, undef *a2, I a3)
{
  undef *l30;
  I l28;
  I l24;
  uI l14;

  _DAT_50420058 = 0;
  _DAT_50420008 = 0;
  _DAT_50420060 = 0;
  _DAT_50420000 = 0;
  l24 = a1 << 3;
  l30 = a2;
  l28 = a3;
  while (true) {
    if (l28 == 0) {
      R 0;
    }
    l14 = 0;
    while (_DAT_5042003c == 0) {
      l14 = l14 + 1;
      if (0xfffffe < l14) {
        R 1;
      }
    }
    if (l28 + -1 == 0) {
      _DAT_50420020 = 1;
    }
    _DAT_50420030 = l24;
    l14 = 0;
    while (_DAT_504200ac == 0) {
      l14 = l14 + 1;
      if (0xfffffe < l14) {
        R 1;
      }
    }
    if (_DAT_50420060 == 1) break;
    *l30 = (C)_DAT_50420024;
    l24 = l24 + 8;
    l30 = l30 + 1;
    l28 = l28 + -1;
  }
  R 2;
}


J otp_read(uI a1, undef8 a2, uI a3)
{
  J lVar1;
  I l14;

  if (a1 < 0x3dd0) {
    if (0x3dd0 - a1 < a3) {
      a3 = 0x3dd0 - a1;
    }
    l14 = otp_read_inner((J)(I)a1, a2, (J)(I)a3);
    if (l14 == 2) {
      l14 = 10;
    }
    lVar1 = (J)l14;
  } else {
    lVar1 = 2;
  }
  R lVar1;
}


J fcn_88004bd4_otp(uI a1)
{
  I iVar1;
  J lVar2;
  undef l15[5];

  if (a1 < 0x40) {
    _DAT_5042005c = 1;
    l15[0] = (undef)(3 << (J)(I)((a1 & 3) << 1));
    iVar1 = fcn_880042c0_otp((J)(I)((a1 >> 2) + 0x3fe0), l15, 1);
    _DAT_5042005c = 0;
    lVar2 = (J)iVar1;
  } else {
    lVar2 = 9;
  }
  R lVar2;
}


undef8 otp_check_fuse_b_bit(uI a1)
{
  if (a1 < 0x20) {
    if ((_DAT_504200bc & 1 << ((J)(I)a1 & 0x1fU)) != 0) {
      R 0xe;
    }
  } else {
    if (0x3f < a1) {
      R 9;
    }
    if ((_DAT_504200b8 & 1 << ((J)(I)(a1 - 0x20) & 0x1fU)) != 0) {
      R 0xe;
    }
  }
  R 0xd;
}


J fcn_88004e9c_otp_read(uI a1)
{
  I iVar1;
  J lVar2;
  undef uStack17;

  if (a1 < 0x40) {
    iVar1 = otp_read_inner((J)(I)((a1 >> 2) + 0x3fe0), &uStack17, 1);
    lVar2 = (J)iVar1;
  } else {
    lVar2 = 9;
  }
  R lVar2;
}


U fcn_880052a0(undef8 a1)
{
  uI uVar1;
  uI uVar2;

  uVar1 = (uI)((U)a1 >> 0x20);
  uVar2 = (uI)a1;
  R((J)(I)(uVar2 >> 8 | uVar2 << 0x18) & 0xff00ff00U |
    (J)(I)(uVar2 << 8 | uVar2 >> 0x18) & 0xff00ffU)
          << 0x20 |
      (J)(I)(uVar1 >> 8 | uVar1 << 0x18) & 0xff00ff00U |
      (J)(I)(uVar1 << 8 | uVar1 >> 0x18) & 0xff00ffU;
}


undef8 sha256_init(C a1, C a2, I a3, undef8 *a4)
{
  sysctl_clock_enable(0x23);
  sysctl_reset(0x1b);
  _DAT_502c0028 = a3 + 0x40U >> 6;
  if (a1 == '\0') {
    _DAT_502c0034 = 0;
  } else {
    _DAT_502c0034 = _DAT_502c0034 | 1;
  }
  if (a2 != '\0') {
    _DAT_502c0030 = _DAT_502c0030 | 1;
  }
  _DAT_502c002c = _DAT_502c002c | 0x10001;
  *a4 = 0;
  *(undef4 *)(a4 + 1) = 0x6a09e667;
  *(undef4 *)((J)a4 + 0xc) = 0xbb67ae85;
  *(undef4 *)(a4 + 2) = 0x3c6ef372;
  *(undef4 *)((J)a4 + 0x14) = 0xa54ff53a;
  *(undef4 *)(a4 + 3) = 0x510e527f;
  *(undef4 *)((J)a4 + 0x1c) = 0x9b05688c;
  *(undef4 *)(a4 + 4) = 0x1f83d9ab;
  *(undef4 *)((J)a4 + 0x24) = 0x5be0cd19;
  *(undef4 *)(a4 + 5) = 0;
  R 1;
}


void sha256_update(J*a1, J a2, uI a3)
{
  uI l44;
  uI l20;
  uI l1c;
  J l18;

  l44 = a3;
  l18 = a2;
  while (l44 != 0) {
    l1c = 0x40 - *(I*)(a1 + 5);
    if (l44 < l1c) {
      l1c = l44;
    }
    memcpy((J)a1 + ((J) * (I*)(a1 + 5) & 0xffffffffU) + 0x2c, l18, (U)l1c);
    *a1 = *a1 + (U)l1c * 8;
    *(uI*)(a1 + 5) = l1c + *(I*)(a1 + 5);
    l18 = l18 + (U)l1c;
    l44 = l44 - l1c;
    if (*(I*)(a1 + 5) == 0x40) {
      l20 = 0;
      while (l20 < 0x10) {
        do {
        } while ((_DAT_502c0034 & 0x100) != 0);
        _DAT_502c0020 = *(undef4 *)((J)a1 + ((U)l20 + 8) * 4 + 0xc);
        l20 = l20 + 1;
      }
      *(undef4 *)(a1 + 5) = 0;
    }
  }
  R;
}


void sha256_final(undef8 *a1, undef4 *a2)
{
  undef4 *l30;
  undef8 l20;
  I l18;
  uI l14;

  l14 = -*(I*)(a1 + 5) + 0x78;
  if (0x40 < l14) {
    l14 = -*(I*)(a1 + 5) + 0x38;
  }
  l20 = fcn_880052a0(*a1);
  sha256_update(a1, &DAT_8800be38, (J)(I)l14);
  sha256_update(a1, &l20, 8);
  do {
  } while ((_DAT_502c002c & 1) == 0);
  if (a2 != (undef4 *)0x0) {
    l18 = 0;
    l30 = a2;
    while (l18 < 8) {
      *l30 = *(undef4 *)((J)(7 - l18) * 4 + 0x502c0000);
      l30 = l30 + 1;
      l18 = l18 + 1;
    }
  }
  R;
}


undef8 sysctl_get_freq(void)
{
  R 26000000;
}


void sysctl_reset_ctl(undef4 a1, C a2)
{
  switch (a1) {
    case 0:
      _DAT_50440030 = _DAT_50440030 & 0xfffffffe | (uI)a2 & 1;
      break;
    case 1:
      _DAT_50440034 = _DAT_50440034 & 0xfffffffe | (uI)a2 & 1;
      break;
    case 2:
      _DAT_50440034 = _DAT_50440034 & 0xfffffffd | ((uI)a2 & 1) << 1;
      break;
    case 3:
      _DAT_50440034 = _DAT_50440034 & 0xfffffffb | ((uI)a2 & 1) << 2;
      break;
    case 4:
      _DAT_50440034 = _DAT_50440034 & 0xfffffff7 | ((uI)a2 & 1) << 3;
      break;
    case 5:
      _DAT_50440034 = _DAT_50440034 & 0xffffffef | ((uI)a2 & 1) << 4;
      break;
    case 6:
      _DAT_50440034 = _DAT_50440034 & 0xffffffdf | ((uI)a2 & 1) << 5;
      break;
    case 7:
      _DAT_50440034 = _DAT_50440034 & 0xffffffbf | ((uI)a2 & 1) << 6;
      break;
    case 8:
      _DAT_50440034 = _DAT_50440034 & 0xffffff7f | ((uI)a2 & 1) << 7;
      break;
    case 9:
      _DAT_50440034 = _DAT_50440034 & 0xfffffeff | ((uI)a2 & 1) << 8;
      break;
    case 10:
      _DAT_50440034 = _DAT_50440034 & 0xfffffdff | ((uI)a2 & 1) << 9;
      break;
    case 0xb:
      _DAT_50440034 = _DAT_50440034 & 0xfffffbff | ((uI)a2 & 1) << 10;
      break;
    case 0xc:
      _DAT_50440034 = _DAT_50440034 & 0xfffff7ff | ((uI)a2 & 1) << 0xb;
      break;
    case 0xd:
      _DAT_50440034 = _DAT_50440034 & 0xffffefff | ((uI)a2 & 1) << 0xc;
      break;
    case 0xe:
      _DAT_50440034 = _DAT_50440034 & 0xffffdfff | ((uI)a2 & 1) << 0xd;
      break;
    case 0xf:
      _DAT_50440034 = _DAT_50440034 & 0xffffbfff | ((uI)a2 & 1) << 0xe;
      break;
    case 0x10:
      _DAT_50440034 = _DAT_50440034 & 0xffff7fff | ((uI)a2 & 1) << 0xf;
      break;
    case 0x11:
      _DAT_50440034 = _DAT_50440034 & 0xfffeffff | ((uI)a2 & 1) << 0x10;
      break;
    case 0x12:
      _DAT_50440034 = _DAT_50440034 & 0xfffdffff | ((uI)a2 & 1) << 0x11;
      break;
    case 0x13:
      _DAT_50440034 = _DAT_50440034 & 0xfffbffff | ((uI)a2 & 1) << 0x12;
      break;
    case 0x14:
      _DAT_50440034 = _DAT_50440034 & 0xfff7ffff | ((uI)a2 & 1) << 0x13;
      break;
    case 0x15:
      _DAT_50440034 = _DAT_50440034 & 0xffefffff | ((uI)a2 & 1) << 0x14;
      break;
    case 0x16:
      _DAT_50440034 = _DAT_50440034 & 0xffdfffff | ((uI)a2 & 1) << 0x15;
      break;
    case 0x17:
      _DAT_50440034 = _DAT_50440034 & 0xffbfffff | ((uI)a2 & 1) << 0x16;
      break;
    case 0x18:
      _DAT_50440034 = _DAT_50440034 & 0xff7fffff | ((uI)a2 & 1) << 0x17;
      break;
    case 0x19:
      _DAT_50440034 = _DAT_50440034 & 0xfeffffff | ((uI)a2 & 1) << 0x18;
      break;
    case 0x1a:
      _DAT_50440034 = _DAT_50440034 & 0xfdffffff | ((uI)a2 & 1) << 0x19;
      break;
    case 0x1b:
      _DAT_50440034 = _DAT_50440034 & 0xfbffffff | ((uI)a2 & 1) << 0x1a;
      break;
    case 0x1c:
      _DAT_50440034 = _DAT_50440034 & 0xdfffffff | ((uI)a2 & 1) << 0x1d;
      break;
    case 0x1d:
      _DAT_50440034 = _DAT_50440034 & 0xbfffffff | ((uI)a2 & 1) << 0x1e;
      break;
    case 0x1e:
      _DAT_50440034 = _DAT_50440034 & 0x7fffffff | (uI)a2 << 0x1f;
  }
  R;
}


void sysctl_reset(I a1)
{
  sysctl_reset_ctl((J)a1, 1);
  sysctl_reset_ctl((J)a1, 0);
  R;
}


undef8 sysctl_clock_bus_en(undef4 a1, C a2)
{
  if (a2 != 0) {
    switch (a1) {
      case 0xe:
      case 0x11:
      case 0x13:
      case 0x14:
      case 0x15:
      case 0x16:
      case 0x17:
      case 0x18:
      case 0x19:
      case 0x1a:
      case 0x1b:
      case 0x1d:
      case 0x1e:
      case 0x1f:
      case 0x20:
      case 0x23:
        _DAT_50440028 = _DAT_50440028 & 0xfffffff7 | ((uI)a2 & 1) << 3;
        break;
      case 0xf:
      case 0x10:
        _DAT_50440028 = _DAT_50440028 & 0xffffffdf | ((uI)a2 & 1) << 5;
        break;
      case 0x1c:
      case 0x21:
      case 0x22:
      case 0x24:
      case 0x25:
        _DAT_50440028 = _DAT_50440028 & 0xffffffef | ((uI)a2 & 1) << 4;
    }
  }
  R 0;
}


undef8 sysctl_clock_device_en(undef4 a1, C a2)
{
  switch (a1) {
    case 0:
      _DAT_50440008 = _DAT_50440008 & 0xfdffffff | ((uI)a2 & 1) << 0x19;
      break;
    case 1:
      _DAT_5044000c = _DAT_5044000c & 0xfdffffff | ((uI)a2 & 1) << 0x19;
      break;
    case 2:
      _DAT_50440010 = _DAT_50440010 & 0xfdffffff | ((uI)a2 & 1) << 0x19;
      break;
    case 3:
      _DAT_50440028 = _DAT_50440028 & 0xfffffffe | (uI)a2 & 1;
      break;
    case 4:
      _DAT_50440028 = _DAT_50440028 & 0xfffffffd | ((uI)a2 & 1) << 1;
      break;
    case 5:
      _DAT_50440028 = _DAT_50440028 & 0xfffffffb | ((uI)a2 & 1) << 2;
      break;
    case 6:
      _DAT_50440028 = _DAT_50440028 & 0xfffffff7 | ((uI)a2 & 1) << 3;
      break;
    case 7:
      _DAT_50440028 = _DAT_50440028 & 0xffffffef | ((uI)a2 & 1) << 4;
      break;
    case 8:
      _DAT_50440028 = _DAT_50440028 & 0xffffffdf | ((uI)a2 & 1) << 5;
      break;
    case 9:
      _DAT_5044002c = _DAT_5044002c & 0xfffffffe | (uI)a2 & 1;
      break;
    case 10:
      _DAT_5044002c = _DAT_5044002c & 0xfffffffd | ((uI)a2 & 1) << 1;
      break;
    case 0xb:
      _DAT_5044002c = _DAT_5044002c & 0xfffffffb | ((uI)a2 & 1) << 2;
      break;
    case 0xc:
      _DAT_5044002c = _DAT_5044002c & 0xfffffff7 | ((uI)a2 & 1) << 3;
      break;
    case 0xd:
      _DAT_5044002c = _DAT_5044002c & 0xffffffef | ((uI)a2 & 1) << 4;
      break;
    case 0xe:
      _DAT_5044002c = _DAT_5044002c & 0xffffffdf | ((uI)a2 & 1) << 5;
      break;
    case 0xf:
      _DAT_5044002c = _DAT_5044002c & 0xffffffbf | ((uI)a2 & 1) << 6;
      break;
    case 0x10:
      _DAT_5044002c = _DAT_5044002c & 0xffffff7f | ((uI)a2 & 1) << 7;
      break;
    case 0x11:
      _DAT_5044002c = _DAT_5044002c & 0xfffffeff | ((uI)a2 & 1) << 8;
      break;
    case 0x12:
      _DAT_5044002c = _DAT_5044002c & 0xfffffdff | ((uI)a2 & 1) << 9;
      break;
    case 0x13:
      _DAT_5044002c = _DAT_5044002c & 0xfffffbff | ((uI)a2 & 1) << 10;
      break;
    case 0x14:
      _DAT_5044002c = _DAT_5044002c & 0xfffff7ff | ((uI)a2 & 1) << 0xb;
      break;
    case 0x15:
      _DAT_5044002c = _DAT_5044002c & 0xffffefff | ((uI)a2 & 1) << 0xc;
      break;
    case 0x16:
      _DAT_5044002c = _DAT_5044002c & 0xffffdfff | ((uI)a2 & 1) << 0xd;
      break;
    case 0x17:
      _DAT_5044002c = _DAT_5044002c & 0xffffbfff | ((uI)a2 & 1) << 0xe;
      break;
    case 0x18:
      _DAT_5044002c = _DAT_5044002c & 0xffff7fff | ((uI)a2 & 1) << 0xf;
      break;
    case 0x19:
      _DAT_5044002c = _DAT_5044002c & 0xfffeffff | ((uI)a2 & 1) << 0x10;
      break;
    case 0x1a:
      _DAT_5044002c = _DAT_5044002c & 0xfffdffff | ((uI)a2 & 1) << 0x11;
      break;
    case 0x1b:
      _DAT_5044002c = _DAT_5044002c & 0xfffbffff | ((uI)a2 & 1) << 0x12;
      break;
    case 0x1c:
      _DAT_5044002c = _DAT_5044002c & 0xfff7ffff | ((uI)a2 & 1) << 0x13;
      break;
    case 0x1d:
      _DAT_5044002c = _DAT_5044002c & 0xffefffff | ((uI)a2 & 1) << 0x14;
      break;
    case 0x1e:
      _DAT_5044002c = _DAT_5044002c & 0xffdfffff | ((uI)a2 & 1) << 0x15;
      break;
    case 0x1f:
      _DAT_5044002c = _DAT_5044002c & 0xffbfffff | ((uI)a2 & 1) << 0x16;
      break;
    case 0x20:
      _DAT_5044002c = _DAT_5044002c & 0xff7fffff | ((uI)a2 & 1) << 0x17;
      break;
    case 0x21:
      _DAT_5044002c = _DAT_5044002c & 0xfeffffff | ((uI)a2 & 1) << 0x18;
      break;
    case 0x22:
      _DAT_5044002c = _DAT_5044002c & 0xfdffffff | ((uI)a2 & 1) << 0x19;
      break;
    case 0x23:
      _DAT_5044002c = _DAT_5044002c & 0xfbffffff | ((uI)a2 & 1) << 0x1a;
      break;
    case 0x24:
      _DAT_5044002c = _DAT_5044002c & 0xf7ffffff | ((uI)a2 & 1) << 0x1b;
      break;
    case 0x25:
      _DAT_5044002c = _DAT_5044002c & 0xdfffffff | ((uI)a2 & 1) << 0x1d;
      break;
    case 0x26:
      _DAT_5044002c = _DAT_5044002c & 0xbfffffff | ((uI)a2 & 1) << 0x1e;
      break;
    case 0x27:
      _DAT_5044002c = _DAT_5044002c & 0x7fffffff | (uI)a2 << 0x1f;
  }
  R 0;
}

undef8 sysctl_clock_enable(uI a1)
{
  undef8 uVar1;

  if (a1 < 0x2a) {
    sysctl_clock_bus_en((J)(I)a1, 1);
    sysctl_clock_device_en((J)(I)a1, 1);
    uVar1 = 0;
  } else {
    uVar1 = 0xffffffffffffffff;
  }
  R uVar1;
}


undef8 sysctl_clock_set_threshold(undef4 a1, uI a2)
{
  switch (a1) {
    case 1:
      _DAT_50440020 = _DAT_50440020 & 0xffffffc7 | (a2 & 7) << 3;
      break;
    case 2:
      _DAT_50440020 = _DAT_50440020 & 0xfffffe3f | (a2 & 7) << 6;
      break;
    case 3:
      _DAT_50440020 = _DAT_50440020 & 0xfffff1ff | (a2 & 7) << 9;
      break;
    case 4:
      _DAT_50440038 = _DAT_50440038 & 0xfffffff0 | a2 & 0xf;
      break;
    case 5:
      _DAT_50440038 = _DAT_50440038 & 0xffffff0f | (a2 & 0xf) << 4;
      break;
    case 6:
      _DAT_50440038 = _DAT_50440038 & 0xfffff0ff | (a2 & 0xf) << 8;
      break;
    case 7:
      _DAT_50440038 = _DAT_50440038 & 0xffff0fff | (a2 & 0xf) << 0xc;
      break;
    case 8:
      _DAT_50440038 = _DAT_50440038 & 0xfff0ffff | (a2 & 0xf) << 0x10;
      break;
    case 9:
      _DAT_5044003c = _DAT_5044003c & 0xffffff00 | a2 & 0xff;
      break;
    case 10:
      _DAT_5044003c = _DAT_5044003c & 0xffff00ff | (a2 & 0xff) << 8;
      break;
    case 0xb:
      _DAT_5044003c = _DAT_5044003c & 0xff00ffff | (a2 & 0xff) << 0x10;
      break;
    case 0xc:
      _DAT_5044003c = _DAT_5044003c & 0xffffff | a2 << 0x18;
      break;
    case 0xd:
      _DAT_50440040 = _DAT_50440040 & 0xffffff00 | a2 & 0xff;
      break;
    case 0xe:
      _DAT_50440040 = _DAT_50440040 & 0xffff00ff | (a2 & 0xff) << 8;
      break;
    case 0xf:
      _DAT_50440040 = _DAT_50440040 & 0xff00ffff | (a2 & 0xff) << 0x10;
      break;
    case 0x10:
      _DAT_50440044 = _DAT_50440044 & 0xffff0000 | a2 & 0xffff;
      break;
    case 0x11:
      _DAT_50440044 =
          _DAT_50440044 & 0xffff | (uI)((U)((J)(I)a2 << 0x30) >> 0x20);
      break;
    case 0x12:
      _DAT_50440048 = _DAT_50440048 & 0xffff0000 | a2 & 0xffff;
      break;
    case 0x13:
      _DAT_50440048 = _DAT_50440048 & 0xff00ffff | (a2 & 0xff) << 0x10;
      break;
    case 0x14:
      _DAT_50440048 = _DAT_50440048 & 0xffffff | a2 << 0x18;
      break;
    case 0x15:
      _DAT_5044004c = _DAT_5044004c & 0xffffff00 | a2 & 0xff;
      break;
    case 0x16:
      _DAT_5044004c = _DAT_5044004c & 0xffff00ff | (a2 & 0xff) << 8;
      break;
    case 0x17:
      _DAT_5044004c = _DAT_5044004c & 0xff00ffff | (a2 & 0xff) << 0x10;
      break;
    case 0x18:
      _DAT_5044004c = _DAT_5044004c & 0xffffff | a2 << 0x18;
      break;
    case 0x19:
      _DAT_50440050 = _DAT_50440050 & 0xffffff00 | a2 & 0xff;
      break;
    case 0x1a:
      _DAT_50440050 = _DAT_50440050 & 0xffff00ff | (a2 & 0xff) << 8;
      break;
    case 0x1b:
      _DAT_50440050 = _DAT_50440050 & 0xff00ffff | (a2 & 0xff) << 0x10;
  }
  R 0;
}


J sysctl_clock_get_threshold(undef4 a1)
{
  uI l14;

  l14 = 0;
  switch (a1) {
    case 0:
      l14 = _DAT_50440020 >> 1 & 3;
      break;
    case 1:
      l14 = _DAT_50440020 >> 3 & 7;
      break;
    case 2:
      l14 = _DAT_50440020 >> 6 & 7;
      break;
    case 3:
      l14 = _DAT_50440020 >> 9 & 7;
      break;
    case 4:
      l14 = _DAT_50440038 & 0xf;
      break;
    case 5:
      l14 = _DAT_50440038 >> 4 & 0xf;
      break;
    case 6:
      l14 = _DAT_50440038 >> 8 & 0xf;
      break;
    case 7:
      l14 = _DAT_50440038 >> 0xc & 0xf;
      break;
    case 8:
      l14 = _DAT_50440038 >> 0x10 & 0xf;
      break;
    case 9:
      l14 = _DAT_5044003c & 0xff;
      break;
    case 10:
      l14 = _DAT_5044003c >> 8 & 0xff;
      break;
    case 0xb:
      l14 = _DAT_5044003c >> 0x10 & 0xff;
      break;
    case 0xc:
      l14 = _DAT_5044003c >> 0x18;
      break;
    case 0xd:
      l14 = _DAT_50440040 & 0xff;
      break;
    case 0xe:
      l14 = _DAT_50440040 >> 8 & 0xff;
      break;
    case 0xf:
      l14 = _DAT_50440040 >> 0x10 & 0xff;
      break;
    case 0x10:
      l14 = (uI)((U)((J)(I)_DAT_50440044 << 0x30) >> 0x30);
      break;
    case 0x11:
      l14 = (uI)((U)((J)(I)(_DAT_50440044 >> 0x10) << 0x30) >> 0x30);
      break;
    case 0x12:
      l14 = (uI)((U)((J)(I)_DAT_50440048 << 0x30) >> 0x30);
      break;
    case 0x13:
      l14 = _DAT_50440048 >> 0x10 & 0xff;
      break;
    case 0x14:
      l14 = _DAT_50440048 >> 0x18;
      break;
    case 0x15:
      l14 = _DAT_5044004c & 0xff;
      break;
    case 0x16:
      l14 = _DAT_5044004c >> 8 & 0xff;
      break;
    case 0x17:
      l14 = _DAT_5044004c >> 0x10 & 0xff;
      break;
    case 0x18:
      l14 = _DAT_5044004c >> 0x18;
      break;
    case 0x19:
      l14 = _DAT_50440050 & 0xff;
      break;
    case 0x1a:
      l14 = _DAT_50440050 >> 8 & 0xff;
      break;
    case 0x1b:
      l14 = _DAT_50440050 >> 0x10 & 0xff;
  }
  R(J)(I) l14;
}


