laanwj/k210-sdk-stuff/rom/k210.rom.c
undef8 sysctl_clock_set_clock_select(undef4 a1, uI a2)
{
  switch (a1) {
    case 0:
      _DAT_50440008 = _DAT_50440008 & 0xff7fffff | (a2 & 1) << 0x17;
      break;
    case 1:
      _DAT_5044000c = _DAT_5044000c & 0xff7fffff | (a2 & 1) << 0x17;
      break;
    case 2:
      _DAT_50440010 = _DAT_50440010 & 0xff7fffff | (a2 & 1) << 0x17;
      break;
    case 3:
      _DAT_50440010 = _DAT_50440010 & 0xf3ffffff | (a2 & 3) << 0x1a;
      break;
    case 4:
      _DAT_50440020 = _DAT_50440020 & 0xfffffffe | a2 & 1;
      break;
    case 5:
      _DAT_50440020 = _DAT_50440020 & 0xffffefff | (a2 & 1) << 0xc;
      break;
    case 6:
      _DAT_50440020 = _DAT_50440020 & 0xffffdfff | (a2 & 1) << 0xd;
      break;
    case 7:
      _DAT_50440020 = _DAT_50440020 & 0xffffbfff | (a2 & 1) << 0xe;
      break;
    case 8:
      _DAT_50440020 = _DAT_50440020 & 0xffff7fff | (a2 & 1) << 0xf;
      break;
    case 9:
      _DAT_50440024 = _DAT_50440024 & 0xfffffffe | a2 & 1;
      break;
    case 10:
      _DAT_50440024 = _DAT_50440024 & 0x7fffffff | a2 << 0x1f;
  }
  R 0;
}


J sysctl_clock_get_clock_select(undef4 a1)
{
  uI l14;

  l14 = 0;
  switch (a1) {
    case 0:
      l14 = _DAT_50440008 >> 0x17 & 1;
      break;
    case 1:
      l14 = _DAT_5044000c >> 0x17 & 1;
      break;
    case 2:
      l14 = _DAT_50440010 >> 0x17 & 1;
      break;
    case 3:
      l14 = _DAT_50440010 >> 0x1a & 3;
      break;
    case 4:
      l14 = _DAT_50440020 & 1;
      break;
    case 5:
      l14 = _DAT_50440020 >> 0xc & 1;
      break;
    case 6:
      l14 = _DAT_50440020 >> 0xd & 1;
      break;
    case 7:
      l14 = _DAT_50440020 >> 0xe & 1;
      break;
    case 8:
      l14 = _DAT_50440020 >> 0xf & 1;
      break;
    case 9:
      l14 = _DAT_50440024 & 1;
      break;
    case 10:
      l14 = _DAT_50440024 >> 0x1f;
  }
  R(J)(I) l14;
}


J sysctl_clock_source_get_freq(undef4 a1)
{
  I l14;

  switch (a1) {
    case 0:
      l14 = 26000000;
      break;
    case 1:
      l14 = sysctl_pll_get_freq(0);
      break;
    case 2:
      l14 = sysctl_pll_get_freq(1);
      break;
    case 3:
      l14 = sysctl_pll_get_freq(2);
      break;
    case 4:
      l14 = sysctl_clock_get_freq(0x28);
      break;
    default:
      l14 = 0;
  }
  R(J) l14;
}


undef8 sysctl_pll_is_lock(uI a1)
{
  undef8 uVar1;
  C l11;

  l11 = 0;
  if (a1 < 3) {
    if (a1 == 1) {
      l11 = (C)((uI)_DAT_50440018 >> 8) & 3;
    } else {
      if (a1 == 0) {
        l11 = (C)_DAT_50440018 & 3;
      } else {
        if (a1 == 2) {
          l11 = (C)((uI)_DAT_50440018 >> 0x10) & 3;
        }
      }
    }
    if (l11 == 3) {
      uVar1 = 1;
    } else {
      uVar1 = 0;
    }
  } else {
    uVar1 = 0;
  }
  R uVar1;
}


undef8 sysctl_pll_clear_slip(uI a1)
{
  J lVar1;
  undef8 uVar2;

  if (a1 < 3) {
    if (a1 == 1) {
      _DAT_50440018 = _DAT_50440018 | 0x400;
    } else {
      if (a1 == 0) {
        _DAT_50440018 = _DAT_50440018 | 4;
      } else {
        if (a1 == 2) {
          _DAT_50440018 = _DAT_50440018 | 0x40000;
        }
      }
    }
    lVar1 = sysctl_pll_is_lock((J)(I)a1);
    if (lVar1 == 0) {
      uVar2 = 0xffffffffffffffff;
    } else {
      uVar2 = 0;
    }
  } else {
    uVar2 = 0xffffffffffffffff;
  }
  R uVar2;
}


undef8 sysctl_pll_enable(uI a1)
{
  undef8 uVar1;

  if (a1 < 3) {
    if (a1 == 1) {
      _DAT_5044000c = _DAT_5044000c & 0xff6fffff | 0x200000;
    } else {
      if (a1 == 0) {
        _DAT_50440008 = _DAT_50440008 & 0xff6fffff | 0x200000;
      } else {
        if (a1 == 2) {
          _DAT_50440010 = _DAT_50440010 & 0xff6fffff | 0x200000;
        }
      }
    }
    uVar1 = 0;
  } else {
    uVar1 = 0xffffffffffffffff;
  }
  R uVar1;
}


J sysctl_pll_get_freq(uI a1)
{
  C bVar1;
  J lVar2;
  I l20;

  l20 = 0;
  if (a1 < 3) {
    if (a1 == 1) {
      sysctl_clock_source_get_freq(0);
      l20 = (_DAT_5044000c >> 10 & 0xf) + 1;
    } else {
      if (a1 == 0) {
        sysctl_clock_source_get_freq(0);
        l20 = (_DAT_50440008 >> 10 & 0xf) + 1;
      } else {
        if (a1 == 2) {
          bVar1 = (C)(_DAT_50440010 >> 0x1a) & 3;
          if (2 < bVar1) {
            R 0;
          }
          sysctl_clock_source_get_freq(
              (J)(I)(uI)(C)(&DAT_8800b900)[(I)(uI)bVar1]);
          l20 = (_DAT_50440010 >> 10 & 0xf) + 1;
        }
      }
    }
    lVar2 = (J)l20;
  } else {
    lVar2 = 0;
  }
  R lVar2;
}


J sysctl_clock_get_freq(undef4 a1)
{
  I iVar1;
  I iVar2;
  J lVar3;
  uI l28;
  uI l24;

  l24 = 0;
  l28 = 0;
  switch (a1) {
    case 0:
      l28 = sysctl_clock_source_get_freq(1);
      break;
    case 1:
      l28 = sysctl_clock_source_get_freq(2);
      break;
    case 2:
      l28 = sysctl_clock_source_get_freq(3);
      break;
    case 3:
      lVar3 = sysctl_clock_get_clock_select(4);
      if (lVar3 == 0) {
        l24 = sysctl_clock_source_get_freq(0);
      } else {
        if (lVar3 == 1) {
          iVar1 = sysctl_clock_source_get_freq(1);
          iVar2 = sysctl_clock_get_threshold(0);
          l24 = (uI)(((J)iVar1 & 0xffffffffU) >> ((J)(iVar2 + 1) & 0x3fU));
        }
      }
      l28 = l24;
      break;
    case 4:
      l28 = sysctl_clock_source_get_freq(4);
      iVar1 = sysctl_clock_get_threshold(4);
      l28 = l28 / (iVar1 + 1U);
      break;
    case 5:
      l28 = sysctl_clock_source_get_freq(4);
      iVar1 = sysctl_clock_get_threshold(5);
      l28 = l28 / (iVar1 + 1U);
      break;
    case 6:
      l28 = sysctl_clock_source_get_freq(4);
      iVar1 = sysctl_clock_get_threshold(1);
      l28 = l28 / (iVar1 + 1U);
      break;
    case 7:
      l28 = sysctl_clock_source_get_freq(4);
      iVar1 = sysctl_clock_get_threshold(2);
      l28 = l28 / (iVar1 + 1U);
      break;
    case 8:
      l28 = sysctl_clock_source_get_freq(4);
      iVar1 = sysctl_clock_get_threshold(3);
      l28 = l28 / (iVar1 + 1U);
      break;
    case 9:
      l28 = sysctl_clock_source_get_freq(4);
      iVar1 = sysctl_clock_get_threshold(8);
      l28 = l28 / (iVar1 + 1U);
      break;
    case 10:
      lVar3 = sysctl_clock_get_clock_select(4);
      if (lVar3 == 0) {
        l24 = sysctl_clock_source_get_freq(0);
      } else {
        if (lVar3 == 1) {
          iVar1 = sysctl_clock_source_get_freq(1);
          iVar2 = sysctl_clock_get_threshold(0);
          l24 = (uI)(((J)iVar1 & 0xffffffffU) >> ((J)(iVar2 + 1) & 0x3fU));
        }
      }
      l28 = l24;
      break;
    case 0xb:
      l28 = sysctl_clock_source_get_freq(2);
      iVar1 = sysctl_clock_get_threshold(6);
      l28 = l28 / (iVar1 + 1U);
      break;
    case 0xc:
      l28 = sysctl_clock_source_get_freq(4);
      iVar1 = sysctl_clock_get_threshold(7);
      l28 = l28 / (iVar1 + 1U);
      break;
    case 0xd:
      lVar3 = sysctl_clock_get_clock_select(4);
      if (lVar3 == 0) {
        l24 = sysctl_clock_source_get_freq(0);
      } else {
        if (lVar3 == 1) {
          iVar1 = sysctl_clock_source_get_freq(1);
          iVar2 = sysctl_clock_get_threshold(0);
          l24 = (uI)(((J)iVar1 & 0xffffffffU) >> ((J)(iVar2 + 1) & 0x3fU));
        }
      }
      l28 = l24;
      break;
    case 0xe:
      l28 = sysctl_clock_get_freq(6);
      break;
    case 0xf:
      l28 = sysctl_clock_source_get_freq(1);
      iVar1 = sysctl_clock_get_threshold(9);
      l28 = l28 / (uI)((iVar1 + 1) * 2);
      break;
    case 0x10:
      l28 = sysctl_clock_source_get_freq(1);
      iVar1 = sysctl_clock_get_threshold(10);
      l28 = l28 / (uI)((iVar1 + 1) * 2);
      break;
    case 0x11:
      l28 = sysctl_clock_source_get_freq(1);
      iVar1 = sysctl_clock_get_threshold(0xb);
      l28 = l28 / (uI)((iVar1 + 1) * 2);
      break;
    case 0x12:
      lVar3 = sysctl_clock_get_clock_select(5);
      if (lVar3 == 0) {
        l24 = sysctl_clock_source_get_freq(0);
      } else {
        if (lVar3 == 1) {
          l24 = sysctl_clock_source_get_freq(1);
        }
      }
      iVar1 = sysctl_clock_get_threshold(0xc);
      l28 = l24 / (uI)((iVar1 + 1) * 2);
      break;
    case 0x13:
      l28 = sysctl_clock_source_get_freq(3);
      iVar1 = sysctl_clock_get_threshold(0x10);
      l28 = l28 / (uI)((iVar1 + 1) * 2);
      break;
    case 0x14:
      l28 = sysctl_clock_source_get_freq(3);
      iVar1 = sysctl_clock_get_threshold(0x11);
      l28 = l28 / (uI)((iVar1 + 1) * 2);
      break;
    case 0x15:
      l28 = sysctl_clock_source_get_freq(3);
      iVar1 = sysctl_clock_get_threshold(0x12);
      l28 = l28 / (uI)((iVar1 + 1) * 2);
      break;
    case 0x16:
      l28 = sysctl_clock_source_get_freq(1);
      iVar1 = sysctl_clock_get_threshold(0x16);
      l28 = l28 / (uI)((iVar1 + 1) * 2);
      break;
    case 0x17:
      l28 = sysctl_clock_source_get_freq(1);
      iVar1 = sysctl_clock_get_threshold(0x17);
      l28 = l28 / (uI)((iVar1 + 1) * 2);
      break;
    case 0x18:
      l28 = sysctl_clock_source_get_freq(1);
      iVar1 = sysctl_clock_get_threshold(0x18);
      l28 = l28 / (uI)((iVar1 + 1) * 2);
      break;
    case 0x19:
      l28 = sysctl_clock_get_freq(6);
      break;
    case 0x1a:
      l28 = sysctl_clock_get_freq(6);
      break;
    case 0x1b:
      l28 = sysctl_clock_get_freq(6);
      break;
    case 0x1c:
      l28 = sysctl_clock_get_freq(7);
      break;
    case 0x1d:
      l28 = sysctl_clock_get_freq(6);
      break;
    case 0x1e:
      lVar3 = sysctl_clock_get_clock_select(6);
      if (lVar3 == 0) {
        l24 = sysctl_clock_source_get_freq(0);
      } else {
        if (lVar3 == 1) {
          l24 = sysctl_clock_source_get_freq(1);
        }
      }
      iVar1 = sysctl_clock_get_threshold(0xd);
      l28 = l24 / (uI)((iVar1 + 1) * 2);
      break;
    case 0x1f:
      lVar3 = sysctl_clock_get_clock_select(7);
      if (lVar3 == 0) {
        l24 = sysctl_clock_source_get_freq(0);
      } else {
        if (lVar3 == 1) {
          l24 = sysctl_clock_source_get_freq(1);
        }
      }
      iVar1 = sysctl_clock_get_threshold(0xe);
      l28 = l24 / (uI)((iVar1 + 1) * 2);
      break;
    case 0x20:
      lVar3 = sysctl_clock_get_clock_select(8);
      if (lVar3 == 0) {
        l24 = sysctl_clock_source_get_freq(0);
      } else {
        if (lVar3 == 1) {
          l24 = sysctl_clock_source_get_freq(1);
        }
      }
      iVar1 = sysctl_clock_get_threshold(0xf);
      l28 = l24 / (uI)((iVar1 + 1) * 2);
      break;
    case 0x21:
      l28 = sysctl_clock_source_get_freq(0);
      iVar1 = sysctl_clock_get_threshold(0x19);
      l28 = l28 / (uI)((iVar1 + 1) * 2);
      break;
    case 0x22:
      l28 = sysctl_clock_source_get_freq(0);
      iVar1 = sysctl_clock_get_threshold(0x1a);
      l28 = l28 / (uI)((iVar1 + 1) * 2);
      break;
    case 0x23:
      l28 = sysctl_clock_get_freq(6);
      break;
    case 0x24:
      l28 = sysctl_clock_get_freq(7);
      break;
    case 0x25:
      l28 = sysctl_clock_get_freq(7);
      break;
    case 0x26:
      lVar3 = sysctl_clock_get_clock_select(4);
      if (lVar3 == 0) {
        l24 = sysctl_clock_source_get_freq(0);
      } else {
        if (lVar3 == 1) {
          iVar1 = sysctl_clock_source_get_freq(1);
          iVar2 = sysctl_clock_get_threshold(0);
          l24 = (uI)(((J)iVar1 & 0xffffffffU) >> ((J)(iVar2 + 1) & 0x3fU));
        }
      }
      l28 = l24;
      break;
    case 0x27:
      l28 = sysctl_clock_get_freq(7);
      break;
    case 0x28:
      lVar3 = sysctl_clock_get_clock_select(4);
      if (lVar3 == 0) {
        l24 = sysctl_clock_source_get_freq(0);
      } else {
        if (lVar3 == 1) {
          iVar1 = sysctl_clock_source_get_freq(1);
          iVar2 = sysctl_clock_get_threshold(0);
          l24 = (uI)(((J)iVar1 & 0xffffffffU) >> ((J)(iVar2 + 1) & 0x3fU));
        }
      }
      l28 = l24;
      break;
    case 0x29:
      lVar3 = sysctl_clock_get_clock_select(4);
      if (lVar3 == 0) {
        l24 = sysctl_clock_source_get_freq(0);
      } else {
        if (lVar3 == 1) {
          iVar1 = sysctl_clock_source_get_freq(1);
          iVar2 = sysctl_clock_get_threshold(0);
          l24 = (uI)(((J)iVar1 & 0xffffffffU) >> ((J)(iVar2 + 1) & 0x3fU));
        }
      }
      l28 = l24;
  }
  R(J)(I) l28;
}

// WARNING: Globals starting with '_' overlap smaller symbols at the same
// address

undef8 sysctl_pll_fast_enable_pll(void)
{
  J lVar1;

