laanwj/k210-sdk-stuff/rom/k210.rom.c
  _DAT_50440008 = _DAT_50440008 & 0xfff00000 | 0xec7b0;
  sysctl_pll_enable(0);
  while (lVar1 = sysctl_pll_is_lock(0), lVar1 == 0) {
    sysctl_pll_clear_slip(0);
  }
  sysctl_clock_enable(0);
  sysctl_clock_set_clock_select(4, 1);
  R 0;
}

// WARNING: Globals starting with '_' overlap smaller symbols at the same
// address

undef8 uarths_putc(C a1)
{
  do {
  } while ((I)_DAT_38000000 < 0);
  _DAT_38000000 = _DAT_38000000 & 0xffffff00 | (uI)a1;
  R 0;
}

// WARNING: Globals starting with '_' overlap smaller symbols at the same
// address

J uarths_getc(void)
{
  do {
  } while ((_DAT_38000004 & 0x80000000) != 0);
  R(J)(I)(_DAT_38000004 & 0xff);
}

undef8 uarths_putchar(C a1)

{
  undef8 uVar1;

  uVar1 = uarths_putc((U)a1);
  R uVar1;
}

undef8 uarths_puts(C*a1)
{
  J lVar1;
  C*l18;

  l18 = a1;
  do {
    if (*l18 == 0) {
      R 0;
    }
    lVar1 = uarths_putc((U)*l18);
    l18 = l18 + 1;
  } while (lVar1 == 0);
  R 0xffffffffffffffff;
}


undef8 serial_init(void)
{
  uI uVar1;

  uVar1 = sysctl_get_freq();
  _DAT_38000008 = _DAT_38000008 & 0xfff8ffff | 1;
  _DAT_3800000c = _DAT_3800000c & 0xfff8ffff | 1;
  _DAT_38000010 = _DAT_38000010 & 0xfffffffe | 2;
  _DAT_38000014 = _DAT_38000014 | 3;
  _DAT_38000018 =
      _DAT_38000018 & 0xffff0000 | (uI)(ushort)((short)(uVar1 / 0x1c200) - 1);
  R 0;
}


void spi_receive_data_1(C*a1, C a2, undef *a3, uI a4)
{
  undef *l28;
  uI l20;
  C l19;
  C*l18;

  *(I*)(_DAT_805fc010 + 4) = a4 - 1;
  *(undef4 *)(_DAT_805fc010 + 8) = 1;
  l19 = a2;
  l18 = a1;
  while (l19 != '\0') {
    *(uI*)(_DAT_805fc010 + 0x60) = (uI)*l18;
    l19 = l19 + -1;
    l18 = l18 + 1;
  }
  *(undef4 *)(_DAT_805fc010 + 0x10) = 1;
  do {
    l28 = a3;
    l20 = a4;
  } while (*(uI*)(_DAT_805fc010 + 0x24) < a4);
  while (l20 != 0) {
    *l28 = (C) * (undef4 *)(_DAT_805fc010 + 0x60);
    l28 = l28 + 1;
    l20 = l20 - 1;
  }
  *(undef4 *)(_DAT_805fc010 + 0x10) = 0;
  *(undef4 *)(_DAT_805fc010 + 8) = 0;
  R;
}


void spi_send_data(C*a1, C a2, C*a3, I a4)
{
  C*l28;
  I l20;
  C l19;
  C*l18;

  *(undef4 *)(_DAT_805fc010 + 8) = 1;
  l19 = a2;
  l18 = a1;
  while (l28 = a3, l20 = a4, l19 != '\0') {
    *(uI*)(_DAT_805fc010 + 0x60) = (uI)*l18;
    l19 = l19 + -1;
    l18 = l18 + 1;
  }
  while (l20 != 0) {
    *(uI*)(_DAT_805fc010 + 0x60) = (uI)*l28;
    l28 = l28 + 1;
    l20 = l20 + -1;
  }
  *(undef4 *)(_DAT_805fc010 + 0x10) = 1;
  do {
  } while ((*(uI*)(_DAT_805fc010 + 0x28) & 5) != 4);
  *(undef4 *)(_DAT_805fc010 + 0x10) = 0;
  *(undef4 *)(_DAT_805fc010 + 8) = 0;
  R;
}


void spi_receive_data_2(undef4 *a1, C a2, undef *a3, uI a4)
{
  undef *l28;
  uI l20;
  C l19;
  undef4 *l18;

  *(I*)(_DAT_805fc010 + 4) = a4 - 1;
  *(undef4 *)(_DAT_805fc010 + 8) = 1;
  l19 = a2;
  l18 = a1;
  while (l19 != '\0') {
    *(undef4 *)(_DAT_805fc010 + 0x60) = *l18;
    l19 = l19 + -1;
    l18 = l18 + 1;
  }
  *(undef4 *)(_DAT_805fc010 + 0x10) = 1;
  do {
    l28 = a3;
    l20 = a4;
  } while (*(uI*)(_DAT_805fc010 + 0x24) < a4);
  while (l20 != 0) {
    *l28 = (C) * (undef4 *)(_DAT_805fc010 + 0x60);
    l28 = l28 + 1;
    l20 = l20 - 1;
  }
  *(undef4 *)(_DAT_805fc010 + 0x10) = 0;
  *(undef4 *)(_DAT_805fc010 + 8) = 0;
  R;
}


void w25qxx_write_enable(void)
{
  undef l18[8];

  l18[0] = 6;
  *_DAT_805fc010 = 7 << ((J)(I)(uI)DAT_805fc018 & 0x1fU) |
                   1 << ((J)(I)(uI)DAT_805fc019 & 0x1fU);
  spi_send_data(l18, 1, 0, 0);
  R;
}


void w25qxx_write_status_reg(undef a1, undef a2)
{
  undef l18;
  undef l17;
  undef l16;

  l18 = 1;
  l17 = a1;
  l16 = a2;
  w25qxx_write_enable();
  spi_send_data(&l18, 3, 0, 0);
  R;
}


void w25qxx_read_status_reg1(undef8 a1)
{
  undef l18[8];

  l18[0] = 5;
  *_DAT_805fc010 = 7 << ((J)(I)(uI)DAT_805fc018 & 0x1fU) |
                   3 << ((J)(I)(uI)DAT_805fc019 & 0x1fU);
  spi_receive_data_1(l18, 1, a1, 1);
  R;
}


void w25qxx_read_status_reg2(undef8 a1)
{
  undef l18[8];

  l18[0] = 0x35;
  *_DAT_805fc010 = 7 << ((J)(I)(uI)DAT_805fc018 & 0x1fU) |
                   3 << ((J)(I)(uI)DAT_805fc019 & 0x1fU);
  spi_receive_data_1(l18, 1, a1, 1);
  R;
}


void w25qxx_enable_quad_mode(void)
{
  C l12;
  C l11;

  w25qxx_read_status_reg2(&l12);
  if ((l12 & 2) == 0) {
    l12 = l12 | 2;
    w25qxx_read_status_reg1(&l11);
    w25qxx_write_status_reg((U)l11, (U)l12);
  }
  R;
}


void flash_read_mode0(I a1, J a2, uI a3)
{
  J l30;
  uI l28;
  I l24;
  undef l18;
  undef l17;
  undef l16;
  undef l15;

  *_DAT_805fc010 = 7 << ((J)(I)(uI)DAT_805fc018 & 0x1fU) |
                   3 << ((J)(I)(uI)DAT_805fc019 & 0x1fU);
  l18 = 3;
  l30 = a2;
  l28 = a3;
  l24 = a1;
  while (true) {
    if (l28 == 0) {
      R;
    }
    l17 = (undef)((uI)l24 >> 0x10);
    l16 = (undef)((uI)l24 >> 8);
    l15 = (undef)l24;
    if (l28 < 0x20) break;
    spi_receive_data_1(&l18, 4, l30, 0x20);
    l28 = l28 - 0x20;
    l24 = l24 + 0x20;
    l30 = l30 + 0x20;
  }
  spi_receive_data_1(&l18, 4, l30, (J)(I)l28);
  R;
}


void flash_read_mode_1_2(I a1, J a2, uI a3)
{
  J l30;
  uI l28;
  I l24;
  undef4 l18;
  I l14;

  l30 = a2;
  l28 = a3;
  l24 = a1;
  if (DAT_805fc01b == '\x02') {
    *_DAT_805fc010 = 7 << ((J)(I)(uI)DAT_805fc018 & 0x1fU) |
                     2 << ((J)(I)(uI)DAT_805fc019 & 0x1fU) |
                     2 << ((J)(I)(uI)DAT_805fc01a & 0x1fU);
    _DAT_805fc010[0x3d] = 0x2221;
    l18 = 0xeb;
  } else {
    *_DAT_805fc010 = 7 << ((J)(I)(uI)DAT_805fc018 & 0x1fU) |
                     2 << ((J)(I)(uI)DAT_805fc019 & 0x1fU) |
                     1 << ((J)(I)(uI)DAT_805fc01a & 0x1fU);
    _DAT_805fc010[0x3d] = 0x221;
    l18 = 0xbb;
  }
  while (true) {
    if (l28 == 0) {
      R;
    }
    l14 = l24 << 8;
    if (l28 < 0x20) break;
    spi_receive_data_2(&l18, 2, l30, 0x20);
    l28 = l28 - 0x20;
    l24 = l24 + 0x20;
    l30 = l30 + 0x20;
  }
  spi_receive_data_2(&l18, 2, l30, (J)(I)l28);
  R;
}


void flash_spi3_config(void)
{
  C l18;
  undef l17;

  l18 = -1;
  l17 = 0xff;
  _DAT_5044002c = _DAT_5044002c | 0x200;
  _DAT_5044003c = _DAT_5044003c & 0xffffff;
  _DAT_805fc010 = &DAT_54000000;
  _DAT_54000008 = 0;
  _DAT_54000010 = 0;
  _DAT_54000014 = 2;
  _DAT_5400002c = 0;
  DAT_805fc018 = 0;
  DAT_805fc019 = 10;
  DAT_805fc01a = 0x16;
  DAT_805fc01b = 0;
  _DAT_54000000 = 0x407;
  spi_send_data(&l18, 2, 0, 0);
  spi_flash_read_manufacturer_id(&l18);
  if (l18 != ' ') {
    DAT_805fc01b = 2;
    w25qxx_enable_quad_mode();
  }
  R;
}


void spi_flash_read_manufacturer_id(undef8 a1)
{
  undef l18[8];

  l18[0] = 0x9f;
  *_DAT_805fc010 = 7 << ((J)(I)(uI)DAT_805fc018 & 0x1fU) |
                   3 << ((J)(I)(uI)DAT_805fc019 & 0x1fU);
  spi_receive_data_1(l18, 1, a1, 1);
  R;
}

void flash_read(I a1, undef8 a2, I a3)
{
  if (DAT_805fc01b == '\0') {
    flash_read_mode0((J)a1, a2, (J)a3);
  } else {
    flash_read_mode_1_2((J)a1, a2, (J)a3);
  }
  R;
}


