laanwj/k210-sdk-stuff/rom/k210.rom.c
void flash_spi0_config(void)
{
  C l18;
  undef l17;

  l18 = -1;
  l17 = 0xff;
  _DAT_805fc010 = &DAT_52000000;
  _DAT_52000008 = 0;
  _DAT_52000010 = 0;
  _DAT_52000014 = 2;
  _DAT_5200002c = 0;
  DAT_805fc018 = 0x10;
  DAT_805fc019 = 8;
  DAT_805fc01a = 0x15;
  DAT_805fc01b = 0;
  _DAT_52000000 = 0x70100;
  spi_send_data(&l18, 2, 0, 0);
  spi_flash_read_manufacturer_id(&l18);
  if (l18 != ' ') {
    DAT_805fc01b = 2;
    w25qxx_enable_quad_mode();
  }
  R;
}

void spi_flash_set_read_mode(undef a1)
{
  DAT_805fc01b = a1;
  R;
}

J fcn_88009bc8_slip(C*a1, I a2)
{
  I l2c;
  C*l28;
  uI l18;
  I l14;

  l18 = 0xffffffff;
  l2c = a2;
  l28 = a1;
  while (l2c != 0) {
    l18 = l18 ^ *l28;
    l14 = 7;
    while (-1 < l14) {
      l18 = l18 >> 1 ^ -(l18 & 1) & 0xedb88320;
      l14 = l14 + -1;
    }
    l28 = l28 + 1;
    l2c = l2c + -1;
  }
  R(J)(I) ~l18;
}

void uarths_set_baudrate(uI a1)
{
  uI uVar1;

  uVar1 = sysctl_clock_get_freq(3);
  *(uI*)(DAT_8800b920 + 0x18) = *(uI*)(DAT_8800b920 + 0x18) & 0xffff0000 |
                                 (uI)(ushort)((short)(uVar1 / a1) - 1);
  R;
}

void slip_handle_pkt(I*a1, ushort *a2, J a3)
{
  I iVar1;
  ushort uVar2;
  I iVar3;
  ushort *l30;
  undef *l28;

  uVar2 = *a2;
  if (uVar2 == 0xc3) {
    if (*a1 != 0) {
      *a1 = 0;
      *(undef *)(a3 + 1) = 0xe3;
      R;
    }
    iVar1 = *(I*)(a2 + 2);
    iVar3 = fcn_88009bc8_slip(a2 + 4, (J)(*(I*)(a2 + 6) + 8));
    if (iVar1 != iVar3) {
      *(undef *)(a3 + 1) = 0xe2;
      R;
    }
    l28 = (undef *)((J) * (I*)(a2 + 4) & 0xffffffff);
    l30 = a2 + 8;
    while (true) {
      iVar3 = *(I*)(a2 + 6);
      iVar1 = iVar3 + -1;
      *(C*)(a2 + 6) = (C)iVar1;
      *(undef *)((J)a2 + 0xd) = (C)((uI)iVar1 >> 8);
      *(C*)(a2 + 7) = (C)((uI)iVar1 >> 0x10);
      *(undef *)((J)a2 + 0xf) = (C)((uI)iVar1 >> 0x18);
      if (iVar3 == 0) break;
      *l28 = *(undef *)l30;
      l30 = (ushort *)((J)l30 + 1);
      l28 = l28 + 1;
    }
    *(undef *)(a3 + 1) = 0xe0;
    *a1 = 0;
    R;
  }
  if (uVar2 < 0xc4) {
    if (uVar2 == 0xc2) {
      *(undef *)(a3 + 1) = 0xe0;
      R;
    }
  } else {
    if (uVar2 == 0xc5) {
      if (*a1 != 0) {
        *a1 = 0;
        *(undef *)(a3 + 1) = 0xe3;
        R;
      }
      (*(code *)((J) * (I*)(a2 + 4) & 0xfffffffe))();
      *(undef *)(a3 + 1) = 0xe0;
      R;
    }
    if (uVar2 == 0xc6) {
      if (*(I*)(a2 + 6) != 4) {
        *(undef *)(a3 + 1) = 0xe1;
        R;
      }
      uarths_set_baudrate((J) * (I*)(a2 + 8));
      *(undef *)(a3 + 1) = 0xe0;
      R;
    }
  }
  *(undef *)(a3 + 1) = 0xe3;
  R;
}

void handle_memory_write(void)
{
  I iVar1;
  J unaff_s0;
  I iVar2;
  J lVar3;

  if (**(I**)(unaff_s0 + -0x38) == 0) {
    iVar1 = *(I*)(*(J*)(unaff_s0 + -0x40) + 4);
    iVar2 = fcn_88009bc8_slip(*(J*)(unaff_s0 + -0x40) + 8,
                              (J)(*(I*)(*(J*)(unaff_s0 + -0x40) + 0xc) + 8));
    if (iVar1 == iVar2) {
      *(U *)(unaff_s0 + -0x28) =
          (J) * (I*)(*(J*)(unaff_s0 + -0x40) + 8) & 0xffffffff;
      *(J*)(unaff_s0 + -0x30) = *(J*)(unaff_s0 + -0x40) + 0x10;
      while (true) {
        iVar2 = *(I*)(*(J*)(unaff_s0 + -0x40) + 0xc);
        iVar1 = iVar2 + -1;
        lVar3 = *(J*)(unaff_s0 + -0x40);
        *(undef *)(lVar3 + 0xc) = (C)iVar1;
        *(undef *)(lVar3 + 0xd) = (C)((uI)iVar1 >> 8);
        *(undef *)(lVar3 + 0xe) = (C)((uI)iVar1 >> 0x10);
        *(undef *)(lVar3 + 0xf) = (C)((uI)iVar1 >> 0x18);
        if (iVar2 == 0) break;
        **(undef **)(unaff_s0 + -0x28) = **(undef **)(unaff_s0 + -0x30);
        *(J*)(unaff_s0 + -0x30) = *(J*)(unaff_s0 + -0x30) + 1;
        *(J*)(unaff_s0 + -0x28) = *(J*)(unaff_s0 + -0x28) + 1;
      }
      *(undef *)(*(J*)(unaff_s0 + -0x48) + 1) = 0xe0;
      **(undef4 **)(unaff_s0 + -0x38) = 0;
    } else {
      *(undef *)(*(J*)(unaff_s0 + -0x48) + 1) = 0xe2;
    }
  } else {
    **(undef4 **)(unaff_s0 + -0x38) = 0;
    *(undef *)(*(J*)(unaff_s0 + -0x48) + 1) = 0xe3;
  }
  R;
}

void handle_baud_rate(void)
{
  J unaff_s0;

  if (*(I*)(*(J*)(unaff_s0 + -0x40) + 0xc) == 4) {
    uarths_set_baudrate((J) * (I*)(*(J*)(unaff_s0 + -0x40) + 0x10));
    *(undef *)(*(J*)(unaff_s0 + -0x48) + 1) = 0xe0;
  } else {
    *(undef *)(*(J*)(unaff_s0 + -0x48) + 1) = 0xe1;
  }
  R;
}

void handle_memory_boot(void)
{
  J unaff_s0;

  if (**(I**)(unaff_s0 + -0x38) == 0) {
    (*(code *)((J) * (I*)(*(J*)(unaff_s0 + -0x40) + 8) & 0xfffffffe))();
    *(undef *)(*(J*)(unaff_s0 + -0x48) + 1) = 0xe0;
  } else {
    **(undef4 **)(unaff_s0 + -0x38) = 0;
    *(undef *)(*(J*)(unaff_s0 + -0x48) + 1) = 0xe3;
  }
  R;
}

void handle_nop(void)
{
  J unaff_s0;

  *(undef *)(*(J*)(unaff_s0 + -0x48) + 1) = 0xe0;
  R;
}

undef8 fcn_8800a160_slip(J a1, C a2)
{
  I iVar1;
  J lVar2;
  short l12;

  lVar2 = *(J*)(a1 + 0x1008);
  l12 = slip_unescape((U)a2, a1 + 0x101c);
  if (-1 < l12) {
    iVar1 = *(I*)(a1 + 0x1018);
    *(I*)(a1 + 0x1018) = iVar1 + 1;
    *(undef *)(lVar2 + ((J)iVar1 & 0xffffffffU)) = (C)l12;
    if (0x410 < *(uI*)(a1 + 0x1018)) {
      l12 = 0;
      *(undef4 *)(a1 + 0x1020) = 0xe1;
    }
  }
  if (l12 == -2) {
    if (*(J*)(a1 + 0x1008) == a1 + 4) {
      *(J*)(a1 + 0x1010) = a1 + 4;
      *(J*)(a1 + 0x1008) = a1 + 0x804;
    } else {
      *(J*)(a1 + 0x1010) = a1 + 0x804;
      *(J*)(a1 + 0x1008) = a1 + 4;
    }
  }
  R 0;
}

void isp_run(void)
{
  I iVar1;
  undef uStack4176;
  undef uStack4175;
  undef uStack4168;
  undef uStack4167;
  undef auStack4160[4];
  undef auStack4156[4100];
  undef *puStack56;
  undef2 *puStack48;
  undef4 uStack40;
  I iStack32;
  C l12;
  C l11;

  l11 = otp_check_fuse_a_bit(2);
  if ((l11 == '\x10') && (iVar1 = otp_check_fuse_b_bit(7), iVar1 == 0xe)) {
    exit(7);
  }
  memset(auStack4160, 0, 0x1028);
  memset(auStack4160, 0, 0x1028);
  puStack56 = auStack4156;
  l12 = 0;
LAB_8800a3dc:
  l12 = uarths_getc();
  fcn_8800a160_slip(auStack4160, (U)l12);
  if (puStack48 == (undef2 *)0x0) goto code_r0x8800a424;
  goto LAB_8800a440;
code_r0x8800a424:
  if (iStack32 != 0) {
  LAB_8800a440:
    if (puStack48 != (undef2 *)0x0) {
      uStack4168 = (undef)*puStack48;
      uStack4167 = 0xe0;
      slip_handle_pkt(auStack4160, puStack48, &uStack4168);
      puStack48 = (undef2 *)0x0;
      uStack40 = 0;
      slip_sendpkt(&uStack4168, 2);
    }
    if (iStack32 != 0) {
      uStack4176 = 0xc1;
      uStack4175 = (undef)iStack32;
      iStack32 = 0;
      uStack40 = 0;
      slip_sendpkt(&uStack4176, 2);
    }
  }
  goto LAB_8800a3dc;
}

// WARNING: Removing unreachable block (ram,0x8800a60c)

void boot_main(void)
{
  C bVar1;
  I iVar2;
  undef8 *puVar3;
  J in_mhartid;
  undef8 l128;
  undef8 l120;
  undef8 l118;
  undef8 l110;
  undef8 l108;
  undef8 l100;
  ushort local_f6;
  I local_f4;
  undef auStack240[116];
  uI l7c;
  C acStack120[32];
  C acStack88[37];
  C l33;
  C l32;
  C l31;
  J l30;
  undef8 *l20;
  I l18;
  I l14;

  l30 = in_mhartid;
  l31 = otp_check_fuse_a_bit(2);
  if (l31 == '\x10') {
    otp_reset(0);
    local_f6 = 0;
    otp_read(0, &local_f4, 4);
    if (local_f4 == 0x4d584f52) {
      otp_read(4, &local_f6, 2);
      otp_read(6, &SUB_805f8000, (J)(I)(uI)local_f6);
      (*(code *)&SUB_805f8000)();
    }
    iVar2 = otp_check_fuse_b_bit(0x3f);
    if (iVar2 == 0xe) {
      turbo_mode_boot();
    }
  }
  if (((l31 != '\x10') || (iVar2 = otp_check_fuse_b_bit(7), iVar2 != 0xe)) &&
      (DAT_8800b8c0[1] = DAT_8800b8c0[1] | 1, (*DAT_8800b8c0 & 1) == 0)) {
    isp_run();
  }
  l33 = 0;
  flash_spi3_config();
  flash_read(0, &l33, 1);
  flash_read(1, &l7c, 4);
  if (0x5fc000 < l7c) {
    exit(0xe9);
  }
  flash_read(5, 0x80000000, (J)(I)l7c);
  flash_read((J)(I)(l7c + 5), acStack120, 0x20);
  if ((l31 == '\x10') && (iVar2 = otp_check_fuse_b_bit(9), iVar2 == 0xe)) {
    l32 = '\x01';
  } else {
    l32 = '\0';
  }
  if (l32 != '\0') {
    otp_read(0x3db0, acStack88, 0x20);
    l14 = 0;
    while (l14 < 0x20) {
      if (acStack120[l14] != acStack88[l14]) {
        isp_run();
      }
      l14 = l14 + 1;
    }
  }
  sha256_init(0, 0, (J)(I)(l7c + 5), auStack240);
  sha256_update(auStack240, &l33, 1);
  sha256_update(auStack240, &l7c, 4);
  sha256_update(auStack240, 0x80000000, (J)(I)l7c);
  sha256_final(auStack240, acStack88);
  l18 = 0;
  while (l18 < 0x20) {
    if (acStack120[l18] != acStack88[l18]) {
      isp_run();
    }
    l18 = l18 + 1;
  }
  if (((l31 == '\x10') && (iVar2 = otp_check_fuse_b_bit(8), iVar2 != 0xe)) &&
      ((l33 & 1) != 0)) {
    otp_set_0c();
    l108 = 0;
    l100 = 0;
    l118 = 0;
    l110 = 0;
    l20 = (undef8 *)&SUB_80000000;
    sysctl_clock_enable(0x1c);
    sysctl_reset(0x14);
    aes_init(&l108, 0x10, &l118, 0x10, 0, 1, 1, 0);
    while (l7c != 0) {
      aes_process_outer(l20, &l128, 0x10, 1);
      puVar3 = l20 + 1;
      *l20 = l128;
      l20 = l20 + 2;
      *puVar3 = l120;
      l7c = l7c - 0x10;
    }
    otp_clear_0c();
  }
  if (l30 == 0) {
    clI_ipi_send(1);
  }
  bVar1 = (*(code *)&SUB_80000000)();
  if (bVar1 == 0xc0) {
    uarths_putchar(0xdb);
    uarths_putchar(0xdc);
  } else {
    if (bVar1 == 0xdb) {
      uarths_putchar(0xdb);
      uarths_putchar(0xdd);
    } else {
      uarths_putchar((U)bVar1);
    }
  }
  R;
}

void slip_sendch(C a1)

{
  if (a1 == 0xc0) {
    uarths_putchar(0xdb);
    uarths_putchar(0xdc);
  } else {
    if (a1 == 0xdb) {
      uarths_putchar(0xdb);
      uarths_putchar(0xdd);
    } else {
      uarths_putchar((U)a1);
    }
  }
  R;
}

void slip_start(void)
{
  uarths_putchar(0xc0);
  R;
}

