laanwj/k210-sdk-stuff/rom/k210.rom.c
void slip_sendinner(J a1, U a2)
{
  I l14;

  l14 = 0;
  while ((U)(J)l14 < a2) {
    slip_sendch((U) * (C*)(a1 + l14));
    l14 = l14 + 1;
  }
  R;
}

void slip_sendpkt(undef8 a1, U a2)
{
  slip_start();
  slip_sendinner(a1, a2 & 0xffffffff);
  slip_start();
  R;
}

J slip_unescape(C a1, I*a2)
{
  I iVar1;
  J lVar2;

  if (a1 == 0xc0) {
    if (*a2 == 0) {
      *a2 = 1;
      lVar2 = -1;
    } else {
      *a2 = 0;
      lVar2 = -2;
    }
  } else {
    iVar1 = *a2;
    if (iVar1 == 1) {
      if (a1 == 0xdb) {
        *a2 = 2;
        lVar2 = -1;
      } else {
        lVar2 = (J)(I)(short)(ushort)a1;
      }
    } else {
      if (iVar1 == 0) {
        lVar2 = -1;
      } else {
        if (iVar1 == 2) {
          if (a1 == 0xdc) {
            *a2 = 1;
            lVar2 = 0xc0;
          } else {
            if (a1 == 0xdd) {
              *a2 = 1;
              lVar2 = 0xdb;
            } else {
              lVar2 = -1;
            }
          }
        } else {
          lVar2 = -1;
        }
      }
    }
  }
  R lVar2;
}

void FUN_8800acdc(uI a1)
{
  uI uVar1;

  uVar1 = sysctl_clock_get_freq(3);
  *(uI*)(DAT_8800b920 + 0x18) = *(uI*)(DAT_8800b920 + 0x18) & 0xffff0000 |
                                 (uI)(ushort)((short)(uVar1 / a1) - 1);
  R;
}

undef8 turbo_mode_boot(void)
{
  undef8 uVar1;
  C l11;

  l11 = 0;
  sysctl_clock_set_clock_select(5, 1);
  sysctl_clock_set_threshold(0xc, 3);
  spi_flash_set_read_mode(0);
  spi_flash_read_manufacturer_id(&l11);
  if (l11 == 0xff) {
    uVar1 = 1;
  } else {
    flash_read(0, &l11, 1);
    if ((l11 >> 1 & 1) == 0) {
      spi_flash_set_read_mode(2);
    } else {
      spi_flash_set_read_mode(1);
    }
    uVar1 = 0;
  }
  R uVar1;
}

undef8 flash_spi0_init(void)
{
  undef8 uVar1;
  C l11;

  l11 = 0;
  fpioa_init();
  sysctl_clock_enable(0x1d);
  sysctl_reset(7);
  sysctl_clock_enable(0xf);
  sysctl_clock_set_threshold(9, 7);
  fpioa_set_function(0x18, 0xc);
  fpioa_set_function(0x1b, 0x11);
  fpioa_set_function(0x19, 4);
  fpioa_set_function(0x1a, 5);
  fpioa_set_function(0x1c, 6);
  fpioa_set_function(0x1d, 7);
  flash_spi0_config();
  spi_flash_set_read_mode(0);
  spi_flash_read_manufacturer_id(&l11);
  if (l11 == 0xff) {
    uVar1 = 1;
  } else {
    flash_read(0, &l11, 1);
    if ((l11 >> 1 & 1) == 0) {
      spi_flash_set_read_mode(2);
    } else {
      spi_flash_set_read_mode(1);
    }
    uVar1 = 0;
  }
  R uVar1;
}

void turbo_mode_boot(void)
{
  undef uVar1;
  undef8 uVar2;
  undef8 uVar3;
  I iVar4;
  J lVar5;
  undef8 *extraout_a1;
  undef8 *puVar6;
  undef8 *puVar7;
  undef8 *puVar8;
  undef8 *puVar9;
  undef8 uVar10;
  undef8 uVar11;
  undef8 uVar12;
  undef8 uVar13;
  undef8 uVar14;
  undef8 uVar15;
  J in_mhartid;
  undef8 l120;
  undef8 l118;
  undef8 l110;
  undef8 l108;
  undef8 l100;
  undef8 local_f8;
  undef auStack240[116];
  uI l7c;
  C acStack120[32];
  C acStack88[38];
  C l32;
  bool l31;
  J l30;
  undef8 *l20;
  I l18;
  I l14;

  l30 = in_mhartid;
  iVar4 = otp_check_fuse_a_bit(2);
  if (iVar4 != 0x10) {
    exit(0xeb);
  }
  sysctl_pll_fast_enable_pll();
  FUN_8800acdc(0x1c200);
  otp_reset(0xe);
  iVar4 = otp_check_fuse_b_bit(7);
  if ((iVar4 != 0xe) &&
      (DAT_8800b8c0[1] = DAT_8800b8c0[1] | 1, (*DAT_8800b8c0 & 1) == 0)) {
    isp_run();
  }
  l32 = 0;
  flash_spi3_config();
  iVar4 = otp_check_fuse_b_bit(0x3e);
  if (iVar4 == 0xe) {
    lVar5 = turbo_mode_boot();
    if (lVar5 != 0) {
      flash_spi0_init();
    }
  } else {
    iVar4 = otp_check_fuse_b_bit(0x3d);
    if (iVar4 == 0xe) {
      flash_spi0_init();
    } else {
      turbo_mode_boot();
    }
  }
  flash_read(0, &l32, 1);
  flash_read(1, &l7c, 4);
  if (0x5fc000 < l7c) {
    exit(0xe9);
  }
  flash_read(5, 0x80000000, (J)(I)l7c);
  flash_read((J)(I)(l7c + 5), acStack120, 0x20);
  iVar4 = otp_check_fuse_b_bit(9);
  l31 = iVar4 == 0xe;
  if (l31) {
    otp_read(0x3db0, acStack88, 0x20);
    l14 = 0;
    while (l14 < 0x20) {
      if (acStack120[l14] != acStack88[l14]) {
        isp_run();
      }
      l14 = l14 + 1;
    }
  }
  sha256_init(0, 0, (J)(I)(l7c + 5), auStack240);
  sha256_update(auStack240, &l32, 1);
  sha256_update(auStack240, &l7c, 4);
  puVar7 = (undef8 *)(J)(I)l7c;
  sha256_update(auStack240, 0x80000000);
  sha256_final(auStack240, acStack88);
  l18 = 0;
  while (l18 < 0x20) {
    if (acStack120[l18] != acStack88[l18]) {
      isp_run();
    }
    l18 = l18 + 1;
  }
  iVar4 = otp_check_fuse_b_bit(8);
  if ((iVar4 != 0xe) && ((l32 & 1) != 0)) {
    otp_set_0c();
    l100 = 0;
    local_f8 = 0;
    l110 = 0;
    l108 = 0;
    l20 = (undef8 *)&SUB_80000000;
    sysctl_clock_enable(0x1c);
    sysctl_reset(0x14);
    puVar7 = &l110;
    aes_init(&l100, 0x10, 0x10, 0, 1, 1, 0);
    while (l7c != 0) {
      puVar7 = (undef8 *)&DAT_00000010;
      aes_process_outer(l20, &l120, 1);
      puVar6 = l20 + 1;
      *l20 = l120;
      l20 = l20 + 2;
      *puVar6 = l118;
      l7c = l7c - 0x10;
    }
    otp_clear_0c();
  }
  if (l30 == 0) {
    clI_ipi_send(1);
  }
  puVar9 = (undef8 *)(*(code *)&SUB_80000000)();
  puVar8 = (undef8 *)((J)puVar9 + (J)puVar7);
  puVar6 = extraout_a1;
  if (((((U)extraout_a1 ^ (U)puVar9) & 7) == 0) &&
      ((undef8 *)0x7 < puVar7)) {
    if (((U)puVar9 & 7) != 0) {
      while (((U)puVar9 & 7) != 0) {
        uVar1 = *(undef *)puVar6;
        puVar6 = (undef8 *)((J)puVar6 + 1);
        *(undef *)puVar9 = uVar1;
        puVar9 = (undef8 *)((J)puVar9 + 1);
      }
    }
    while (puVar9 < (undef8 *)((U)puVar8 & 0xfffffffffffffff8) + -8) {
      uVar2 = puVar6[1];
      uVar15 = puVar6[2];
      uVar14 = puVar6[3];
      uVar13 = puVar6[4];
      uVar12 = puVar6[5];
      uVar3 = puVar6[6];
      uVar11 = puVar6[7];
      uVar10 = puVar6[8];
      *puVar9 = *puVar6;
      puVar9[1] = uVar2;
      puVar9[2] = uVar15;
      puVar9[3] = uVar14;
      puVar9[4] = uVar13;
      puVar9[5] = uVar12;
      puVar9[6] = uVar3;
      puVar9[7] = uVar11;
      puVar9[8] = uVar10;
      puVar6 = puVar6 + 9;
      puVar9 = puVar9 + 9;
    }
    while (puVar9 < (undef8 *)((U)puVar8 & 0xfffffffffffffff8)) {
      uVar2 = *puVar6;
      puVar6 = puVar6 + 1;
      *puVar9 = uVar2;
      puVar9 = puVar9 + 1;
    }
    if (puVar8 <= puVar9) {
      R;
    }
  } else {
    if (puVar8 <= puVar9) {
      R;
    }
  }
  while (puVar9 < puVar8) {
    uVar1 = *(undef *)puVar6;
    puVar6 = (undef8 *)((J)puVar6 + 1);
    *(undef *)puVar9 = uVar1;
    puVar9 = (undef8 *)((J)puVar9 + 1);
  }
  R;
}

void memcpy(undef8 *a1, undef8 *a2, U a3)
{
  undef uVar1;
  undef8 uVar2;
  undef8 uVar3;
  undef8 *puVar4;
  undef8 uVar5;
  undef8 uVar6;
  undef8 uVar7;
  undef8 uVar8;
  undef8 uVar9;
  undef8 uVar10;

  puVar4 = (undef8 *)((J)a1 + a3);
  if (((((U)a2 ^ (U)a1) & 7) == 0) && (7 < a3)) {
    if (((U)a1 & 7) != 0) {
      while (((U)a1 & 7) != 0) {
        uVar1 = *(undef *)a2;
        a2 = (undef8 *)((J)a2 + 1);
        *(undef *)a1 = uVar1;
        a1 = (undef8 *)((J)a1 + 1);
      }
    }
    while (a1 < (undef8 *)((U)puVar4 & 0xfffffffffffffff8) + -8) {
      uVar2 = a2[1];
      uVar10 = a2[2];
      uVar9 = a2[3];
      uVar8 = a2[4];
      uVar7 = a2[5];
      uVar3 = a2[6];
      uVar6 = a2[7];
      uVar5 = a2[8];
      *a1 = *a2;
      a1[1] = uVar2;
      a1[2] = uVar10;
      a1[3] = uVar9;
      a1[4] = uVar8;
      a1[5] = uVar7;
      a1[6] = uVar3;
      a1[7] = uVar6;
      a1[8] = uVar5;
      a2 = a2 + 9;
      a1 = a1 + 9;
    }
    while (a1 < (undef8 *)((U)puVar4 & 0xfffffffffffffff8)) {
      uVar2 = *a2;
      a2 = a2 + 1;
      *a1 = uVar2;
      a1 = a1 + 1;
    }
    if (puVar4 <= a1) {
      R;
    }
  } else {
    if (puVar4 <= a1) {
      R;
    }
  }
  while (a1 < puVar4) {
    uVar1 = *(undef *)a2;
    a2 = (undef8 *)((J)a2 + 1);
    *(undef *)a1 = uVar1;
    a1 = (undef8 *)((J)a1 + 1);
  }
  R;
}

void memset(U*a1, U a2, U a3)
{
  U uVar1;
  U *puVar2;
  U uVar3;

  uVar1 = 0xf;
  if (0xf < a3) {
    uVar3 = (U)a1 & 0xf;
    if (uVar3 != 0) {
      a2 = (*(code *)(uVar3 * 4 + 0x8800b41c))();
      a1 = (U *)((J)a1 - (uVar3 - 0x10));
      a3 = a3 + (uVar3 - 0x10);
      if (a3 <= uVar1) goto LAB_8800b410;
    }
    if (a2 != 0) {
      a2 = a2 & 0xff | (a2 & 0xff) << 8;
      a2 = a2 | a2 << 0x10;
      a2 = a2 | a2 << 0x20;
    }
    uVar3 = a3 & 0xfffffffffffffff0;
    a3 = a3 & 0xf;
    puVar2 = (U *)(uVar3 + (J)a1);
    do {
      *a1 = a2;
      a1[1] = a2;
      a1 = a1 + 2;
    } while (a1 < puVar2);
    if (a3 == 0) {
      R;
    }
  }
LAB_8800b410:
  // WARNING: Could not recover jumptable at 0x8800b41c. Too many branches
  // WARNING: Treating indirect jump as call
  (*(code *)((uVar1 - a3) * 4 + 0x8800b420))();
  R;
}

C*strlen(C*a1)
{
  C cVar1;
  C*pcVar2;

  pcVar2 = a1;
  do {
    pcVar2 = pcVar2 + 1;
    cVar1 = *pcVar2;
    pcVar2 = pcVar2;
  } while (cVar1 != '\0');
  R pcVar2 + (-1 - (J)a1);
}



//:~
